{
    "product_name": "Microsoft Surface Pro 6 (Intel Core i5, 8GB RAM, 128GB) - Newest Version and Microsoft Surface Pro Type Cover – BlackASUS VivoBook L203MA Ultra-Thin Laptop, Intel Celeron N4000 Processor, 4GB LPDDR4, 64GB...ASUS VivoBook Flip 14 Thin and Light 2-in-1 HD Touchscreen Laptop, Intel 2.6GHz...Microsoft Surface Pro 6 (Intel Core i5, 8GB RAM, 128GB) Bundle with Black Type Cover and...LG gram Laptop - 15.6\" Full HD Touchscreen, Intel 8th Gen Core i7, 16GB RAM, 1TB (2 x...Samsung Electronics XE500C13 Chromebook 3 2GB RAM 16GB SSD Laptop, 11.6\"",
    "product_price": "$799.00",
    "number_reviews": "345",
    "ratings": {
        "5 star": "70%",
        "4 star": "8%",
        "3 star": "4%",
        "2 star": "4%",
        "1 star": "14%"
    },
    "reviews": [
        {
            "review_text": "I’ve primary use this for photoshop and illustrator. Nothing too intense so it’s been doing well for me. I find the portability great for productivity. No real issues with lag or hang ups.",
            "review_posted_date": "08 Apr 2019",
            "review_header": "Love the power and portability",
            "review_rating": "5.0 ",
            "review_author": "Julie Herron"
        },
        {
            "review_text": "Spent a good amount of time researching the different variations of the surface pro. Decided I wanted to spend a little more money to get larger storage and faster processing speed. Definitely worth it. Got this for my MA program where I will need a reliable computer that can handle running multiple apps at once. Very happy with my decision. I do not use the touch screen but it does work well.",
            "review_posted_date": "02 Jun 2019",
            "review_header": "Overall, satisfied",
            "review_rating": "5.0 ",
            "review_author": "L"
        },
        {
            "review_text": "I was excited when ordered this product hoping for the solid performance of i5 8th gen but unfortunately i received the one with i5 7300u (7th gen)",
            "review_posted_date": "10 Jun 2019",
            "review_header": "Received 2017 version !!",
            "review_rating": "1.0 ",
            "review_author": "Mohamed A."
        },
        {
            "review_text": "Is very light and handy.",
            "review_posted_date": "02 Apr 2019",
            "review_header": "Works wonderful.",
            "review_rating": "4.0 ",
            "review_author": "Miguel Walle"
        },
        {
            "review_text": "The computer is great. Instructions for programming are lacking and for the money Web addresses at the very least should be made available to the purchaser. I have had to search for information, and still having problems getting the computer to recognize AOL mail. The on-line instructions I have found do not work. Any help you can provide would be much appreciated! Otherwise, absolutely no complaints. Deliveries were on time and there was no damage to the products.",
            "review_posted_date": "25 Dec 2018",
            "review_header": "Instructions for use are non-existent",
            "review_rating": "5.0 ",
            "review_author": "Robert F. Malacoff"
        },
        {
            "review_text": "I love the product. My review is for the damn vendor. I purchased this as a new product and I received a box without the original plastic film, without the original stickers (the ones that won't leave residues if you peel them off) and my device had particles of dust and cloth on top. Also de device has a slight problem with the paint coating, the glass has spots where oil shows more than other places. But the most annoying one is that my kickstand is wobbly. Not sturdy as it is supposed to be. I'm really pissed of because I payed a lot of money for this, and now I'm nonlonger in the US so asking for a replacement is expensive for me. I guess I'm stuck with this.",
            "review_posted_date": "09 May 2019",
            "review_header": "I received a used device instead of a new one",
            "review_rating": "1.0 ",
            "review_author": "JOSE ROBERTO RAMIREZ NAJERA"
        },
        {
            "review_text": "A true tablet to replace your laptop. Great performance, great format, great accesories. The whole package is pricey though (surface + pen + typecover). Yet if you value design, mobility and performance, you'll love this product.",
            "review_posted_date": "02 Jun 2019",
            "review_header": "Awesome product! Best of it's kind",
            "review_rating": "5.0 ",
            "review_author": "Benjamin Vigneaux"
        },
        {
            "review_text": "I had the iPad Pro for a couple weeks and sent it back because I couldn't run all the programs I wanted to record shows remotely and edit video. Grabbed the Surface Pro instead and it works just like a windows laptop. Love how slim it is and that I could downgrade to a small carrying case. I might buy another one!",
            "review_posted_date": "29 May 2019",
            "review_header": "Love this computer and it is a computer",
            "review_rating": "5.0 ",
            "review_author": "craig coglianese"
        },
        {
            "review_text": "Only had the computer for a short while. So far it fits all of my needs. It is faster than my last computer. The battery lasts as long as I need it. So, no complaints.",
            "review_posted_date": "19 Jan 2019",
            "review_header": "Fits all of my needs",
            "review_rating": "5.0 ",
            "review_author": "Barbara F."
        },
        {
            "review_text": "Kills my MacBook Pro. Microsoft really did good developing this one! I may not replace my Apple products when they extinct themselves. Docking station helpful add on",
            "review_posted_date": "04 Jul 2019",
            "review_header": "Great computer",
            "review_rating": "5.0 ",
            "review_author": "P. A. Schechter"
        },
        {
            "review_text": "I'm more that satisfied with my Surface Pro and Pen. It is everything I expected after long, diligent searches. Only I should have purchased a much larger internal hard disk than 128 GB. Other than that, I really enjoy my computer. I can't say enough about the service through Amazon from Beach Camera.My order was exact, the price was right, and the delivery was perfect and on time. I wouldn't hesitate to order again from Beach Camera, and Amazon, to me, is the best. I'm very pleased!",
            "review_posted_date": "15 Dec 2018",
            "review_header": "MOST SATISFIED",
            "review_rating": "5.0 ",
            "review_author": "Robert J. Zamorski"
        },
        {
            "review_text": "Buyer beware. I bought my NEW Surface Pro, with the Surface Pen and Surface Type Cover purchased separately on March 11 and received them on March 13. It is now May 17 and so far: 1. I have had to replace the charger. I cleaned the pins, I cleaned the slot. I don't use it around food or drinks. My charged has never fallen on the floor. I tested other people's chargers (they worked!) but mine did not. So on May 11, exactly 2 months to the purchase date, I was spending more money on an already expensive product. 2. The day after the new charger was purchased, the Facial Recognition feature stopped working. As in, that little 'eye' and the red dot near the camera disappeared and I was forced to enter my PIN multiple times a day. This meant that if I had a show or podcast that was streaming and I opened my Surface Pro, there was about a 15 second delay in getting the show to stop blasting at whatever volume I had left it at. Huh, you say? (See #3 below) 3. My Surface Pro would begin playing streaming video and podcasts anytime it was plugged in. So, if I had paused a video on it last night, brought it in to work the next morning, and plugged it in to charge WITHOUT opening it at all, it would start the show at full volume on its own. Who pressed play?!?! Many a day I was left scrambling to hit the pause button on a computer I had not even turned on. Remember, it stopped recognizing my face? So I had to enter the PIN? It would take forever to get to that. Meanwhile, my show would be on full blast. The first time it happened, I plugged in the charger, and rushed away from my desk to a meeting. I returned to some VERY NASTY LOOKS from my colleagues. My video had been running, loudly, for the full 20 minutes I was gone. 4. My Surface Pro would start and stop playing paused videos randomly. Like, at 2AM. Do you know how scary it is to have multiple voices out of nowhere in your bedroom while you are sleeping? My husband and I bolted right up with our hearts racing. Were we being robbed? Was there an emergency? No, it was just my Surface Pro watching videos on its own. 5. The keyboard. *SIGH* Today, the type cover just refused to be recognized. No keys, no touchpad, no backlighting. There are times when merely resting the heel of my palms on the cover (to the sides of the touchpad but below the keys - an area that should have zero functionality or consequence), while typing would cause strange menus and functions to appear onscreen. I'm typing the body of an email and suddenly my text is in the subject line. Of course I don't realize this until a good paragraph in and I can't find the words I'm typing but they have jumped up to the subject line. Or, I'm using the touchpad and in the middle of typing and suddenly 2 other open pages are closed out. 6. Facial Recognition has been restored. Wait, so why am I listing it here as a complaint? Well, that's because I did absolutely nothing to bring it back. So that function seems to come and go at will. Which means I have no control over when it will disappear again. So I have to immediately close every page that has a video after I'm done watching it or take a chance that it'll start playing and facial recognition (the quickest way to turn on my computer) will vanish again and everyone withing earshot will know exactly what i was watching last night. I just bought this computer 2 months ago. Is this what I should expect of a new product?",
            "review_posted_date": "17 May 2019",
            "review_header": "Ugh",
            "review_rating": "1.0 ",
            "review_author": "Cheezees"
        },
        {
            "review_text": "Just an overpriced computer. The performance is just terrible and the user experience makes it very unpleasant to use.",
            "review_posted_date": "15 Dec 2018",
            "review_header": "Still terrible even after 6 iterations",
            "review_rating": "1.0 ",
            "review_author": "Clay"
        },
        {
            "review_text": "There was backlight bleed on bottom edge and top corner. Also random programs and apps shutdowns. Installed all windows updates etc and couldn't figure out why. Had to return.",
            "review_posted_date": "03 Dec 2018",
            "review_header": "very nice tablet but",
            "review_rating": "3.0 ",
            "review_author": "boubacar"
        },
        {
            "review_text": "I've been using iPads since their inception. I even had an Apple Newton decades ago. I've been in IT for 20 years, mostly on the Windows side. I have been very impressed with the Surface Pro 6. I bought it to replace my iPad and laptop. I use the Kingston Blackbelt 2nd Degree Case and a magnetic privacy screen. It's lightweight, durable, and the screen is crystal. Keeping it clean is a bit of a challenge, so you may want to get a screen protector. Battery life is questionable, and really depends on the applications you run, this applies to every battery operated Windows device. I have fully replaced my iPad with this, knowing they aren't really comparable to each other. The Surface is very much a full-fledged computer, able to function and perform well - while an iPad is basically just an oversized faster iPhone.",
            "review_posted_date": "16 Feb 2019",
            "review_header": "The iPad Pro Killer",
            "review_rating": "5.0 ",
            "review_author": "Frank"
        },
        {
            "review_text": "I love it",
            "review_posted_date": "17 Nov 2018",
            "review_header": "perfect",
            "review_rating": "5.0 ",
            "review_author": "alex bardascino"
        },
        {
            "review_text": "I was a bit skeptical about ordering the Surface Pro 6 (8GB RAM, 2.6GHz i5, Windows 10 Home) because of it's size vs power. I didn't think a device so small could be as functional as a laptop or PC. It is for everything I do. I'm not a gamer (that's what consoles are for, in my opinion), but I'll include some of the programs I use, that work better on this Surface Pro 6 than they did on my former PC (Asus MAXIMUS V GENE Z77, i7-3770, 16GB DDR3, Corsair 256 SSD, Windows 10 Ultimate) . Programs: MacXHD Video Converter, ConvertXtoDVD, Adobe Photoshop CS5, AutoCAD 2019 and Inventor 2019. The Surface I have is fan-less, and I haven't had any heat issued when using intense programs like converting videos, burning DVD's (with an external, USB DVD drive) nor whilst using Inventor creating 3D assemblies. The 12 inch screen will certainly suffice when surfing the net and doing simple tasks, however I use a 24 inch monitor while working via the mini display port. I would recommend the Surface Pen for tablet use, and a mouse when using for longer work periods. The Surface keyboard for the Surface series is all I need, but if you prefer you could easily use any bluetooth keyboard. I leave the power cable connected when working and the battery exceeds my needs when using as portable, I haven't timed it's drain frequency so I can't comment on the batter use under load. The only thing I would complain about it the lack of USB C, but that really isn't an issue since I don't own any USB C devices.",
            "review_posted_date": "15 Apr 2019",
            "review_header": "Average PC replacement",
            "review_rating": "5.0 ",
            "review_author": "Xfertime"
        },
        {
            "review_text": "I was in need of upgrading my outdated galaxy note 10 2014 edition tablet. I wanted something that I could easily carry to work and use for school so I decided I wanted a windows device but not a full laptop (have one and it's heavy). I also have a 2 in 1 chromebook that's a few years old but it has its faults. I was trying to decide between this one or the galaxy book. I ultimately went with the surface pro and so far love it. I did have to get use to the size as I've used smaller screen sized products. I haven't had any issues yet. I did get a screen protector and a keyboard to complete it. It is lightweight, easy to carry, fast, easy setup using my microsoft account so some programs transferred from my laptop. I also ordered a bluetooth mouse which connected without issues and a stylus (non-microsoft which works great but I find i'm actually not using it as much as I thought I would.",
            "review_posted_date": "17 Feb 2019",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "Ashley Taylor"
        },
        {
            "review_text": "I would not recommend buying the Insurance from Amazon, many people report problems on making claims. Assurion et al. I bought from Amazon Services Inc. Then within 45 days of first activation, I phoned Microsoft with proof of purchase to get the amazing $150 Microsoft Complete Surface care package, which entitles you to a 2 year warranty and 2 accidental damage replacements - drops and spills.",
            "review_posted_date": "18 Apr 2019",
            "review_header": "A note on Accidental Damage Insurance",
            "review_rating": "5.0 ",
            "review_author": "Andy Alford"
        },
        {
            "review_text": "this is not a surface pro 6. this is an older model. and others have gotten this too. this is a SCAM! not 4 cores, processor or model.",
            "review_posted_date": "08 Jul 2019",
            "review_header": "Not as Advertised! Beware!",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Review written after a weekend of use... purchased following a fair amount of research. So far, lots of pleasant surprises with this machine. First was how quickly it came! One recommendation: shop carefully. I found it significantly cheaper to purchase the keyboard separately rather than in a \"bundle.\" (The keyboard actually arrived a day before the Surface Pro.) Most of my work is done on a desktop, the Pro will be a traveling device and is an upgrade from a similar but much cheaper (smaller and slower) device. So far, I'm favorably impressed. It's fast when turned on and quite responsive. One caution is that the keyboard connection is not particularly solid--once while moving everything, the tablet actually fell off the keyboard. I won't say that I've used it enough to give a concrete review but it does seem like a good compromise between a laptop and a tablet. One pleasant surprise is that it appears possible to create a wireless connection between it and a projector/display with the purchase of the proper adaptor--I knew I'd need an adaptor but didn't realize there could be a wireless connection. Like a Barbie Doll, it's possible to spend a lot on accessories. Microsoft doesn't (or at least I couldn't find) provide a lot of helpful information for shoppers, so it can be hard to know if you're making good decisions regarding memory, etc. (The closest bricks and mortar store for me is three hours away.) I find myself wondering if a day trip would have been worth it--if only to confirm that I was making good choices. So far, so good!",
            "review_posted_date": "15 Apr 2019",
            "review_header": "Nice little machine...",
            "review_rating": "5.0 ",
            "review_author": "Mr. B"
        },
        {
            "review_text": "I'm very happy with my purchase, this laptop is pretty fast and having the option of using it as tablet, is great! Love drawing on it, you can even rest your arm without a problem",
            "review_posted_date": "08 Dec 2018",
            "review_header": "I love it",
            "review_rating": "5.0 ",
            "review_author": "Me"
        },
        {
            "review_text": "I love it",
            "review_posted_date": "15 Nov 2018",
            "review_header": "Great product",
            "review_rating": "5.0 ",
            "review_author": "Jim B Gillen"
        },
        {
            "review_text": "This was a special promotion just before christmas that included a type cover so I bought a pen separately and now it came without a type cover!!! Really... I bought it for my wife as a christmas gift and wrapped it immediately...thinking that it will be in the box with the surface pro, well it was not!!",
            "review_posted_date": "14 Jan 2019",
            "review_header": "promotion with type cover and it came without a type cover!",
            "review_rating": "1.0 ",
            "review_author": "Nico D."
        },
        {
            "review_text": "Stay away from these...proprietary charging system (not just a simple micro usb) that stopped working less than a month after purchase.",
            "review_posted_date": "08 Feb 2019",
            "review_header": "Charger is horrid",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "First it arrived Christmas Eve, 3 days before promised! Next I was able to successfully set it up! And the Surface talks to the keyboard! I bought one from Best Buy that only spoke Spanish and the replacement wouldn’t talk to the keyboard! Returned for a refund to Best Buy and I couldn’t be happier with this one from Amazon!",
            "review_posted_date": "24 Dec 2018",
            "review_header": "It works!",
            "review_rating": "5.0 ",
            "review_author": "Debb"
        },
        {
            "review_text": "Ok, this is an interesting product. I am very much surprised at the performance of this machine as a laptop. It's fast. Battery life is great. It is responsive and handles anything I throw at it. What does piss me off a bit are the ports. HDMI is not available without the dock or some adapter. Ok, I guess that's fair. It's too small for full sized ports. But the price for the dock is stupid and it still limits you. The keyboard is amazingly good. I use arrows a lot and they are tiny. They should be bigger. I miss the numeric keypad of larger machines but I can't fault it for that Touch pad is excellent. I also bought the Surface Bluetooth mouse which is fine and it talked to it effortlessly. Screen is awesome. Sound likewise. What let's it down is when you pull it off the keyboard to use as a tablet. Windows tablet mode sucks, period. But it's better than nothing. As a portable computer, this thing rocks.",
            "review_posted_date": "25 Mar 2019",
            "review_header": "Excellent small computer. Not a great tablet",
            "review_rating": "4.0 ",
            "review_author": "Michael J"
        },
        {
            "review_text": "I use this for research, writing, some Netflix/Prime Video, and backup to a work computer with Office apps. This was an upgrade for me over an Acer tablet also running Win10. Amazed. It does everything I ask it to and quickly. Screen and trackpad are easy and bugless to navigate. Some bloatware, but it can be deleted. Battery is amazing. Cameras on it are like midrange cellphone good. Speakers are not bad at all for their size, not tinny. No complaints.",
            "review_posted_date": "08 Apr 2019",
            "review_header": "Well worth the extra cost",
            "review_rating": "5.0 ",
            "review_author": "zltmn"
        },
        {
            "review_text": "I am a teacher and the district had teachers test out I believe eight different portable devices. Of all of the contestants, the teachers voted the Surface the best device, so the district decided to get Surface Pros for their teachers. While not with that district anymore, I was struggling to cope in a relatively tech-free environment. It just wouldn't do. Having taught for a year and a half being mobile; able to move about the classroom and still control the screen, I needed that flexibility back. Saying good bye to a paycheck was worth getting a quality Surface. It lasts through the school day and on nights that I'm free I can do some gaming on it before charging it up that night. I was hoping not to be disappointed--as I have been with laptops I've tried before--so I made sure to spend the money to get a high caliber Surface... and I have not been disappointed!",
            "review_posted_date": "15 Jan 2019",
            "review_header": "Portable, Capable, Wonderful Computer/Tablet",
            "review_rating": "5.0 ",
            "review_author": "Alan"
        },
        {
            "review_text": "This tablet PC is by far the best computer you can buy if you travel and are light weight user. I have the 256GB i5 core. I have Photoshop, Illustrator, Lightroom, and Revit installed for my needs and it handles the programs well.",
            "review_posted_date": "29 Dec 2018",
            "review_header": "Been waiting for something like this in this form factor.",
            "review_rating": "5.0 ",
            "review_author": "angelo lobaton"
        },
        {
            "review_text": "Buyer beware. This is advertised as a Surface Pro 6 however upon registering the device and checking the system information with Microsoft, it was determined to be a Surface Pro 5th generation aka Surface Pro 6.",
            "review_posted_date": "22 May 2019",
            "review_header": "Didn’t receive Surface Pro 6",
            "review_rating": "1.0 ",
            "review_author": "K. Daniel"
        },
        {
            "review_text": "The photo is entirely misleading because buyers are lead to believe it comes with a keyboard and pen. It doesn’t Caution read the questions and reviews before purchasing. I returned the first one and was about ready to return the second one before I discovered that the picture is misleading. It is the time wasted that was most frustrating. Hopefully I’ll be happy with the product when I get the keyboard and pen.",
            "review_posted_date": "07 Jun 2019",
            "review_header": "THE PICTURE IS MISLEADING",
            "review_rating": "1.0 ",
            "review_author": "Paul T Clark"
        },
        {
            "review_text": "I have always considered laptops as disposable. If they start to give the kids a problem at college, just get another one. Don't have time to wait for a repair. Well, the laptops have become so unreliable that they don't even last a year anymore. Done with them. 3 of my kids now have these Surface Pros and they all love them. They are not put together with the cheapest components so they do cost more. However, they are designed to work together, manage heat well and last. If you do art, choose Apple. If you do engineering and spreadsheets, choose a Surface Pro. The oldest one we have is 3 years old and still works perfect. These are light and thin so they fit in the backpack well. Very happy with this product.",
            "review_posted_date": "16 Mar 2019",
            "review_header": "No more Dell or HP laptops",
            "review_rating": "5.0 ",
            "review_author": "Angela Scattarelli Hatch"
        },
        {
            "review_text": "Don't buy this device as it comes with Windows 10 HOME which is complete crap if you intend to use the device in any professional; / business capacity. If all you want to do is play candy crush, then it's fine. But if you want to get work done, get something else with Win 10 Pro.",
            "review_posted_date": "12 May 2019",
            "review_header": "Windows 10 HOME = MS Bloatware and Garbage",
            "review_rating": "1.0 ",
            "review_author": "ZackInMA"
        },
        {
            "review_text": "Wicked stoked on this machine. The new cores really make a difference in gaming. Better battery life, light, and comfortable. Wish it had usb c but I am sure the next iteration will. Traded up from the 2017 model and haven’t been disappointed.",
            "review_posted_date": "23 Jun 2019",
            "review_header": "Battery",
            "review_rating": "5.0 ",
            "review_author": "joshua t."
        },
        {
            "review_text": "Always been a surface pro fan, however 2 weeks after receiving and minimal use, I began to see screen flickering at the top 2 inches. After researching problem and attempting all troubleshooting from Microsoft, it could not be fixed and was a hardware problem. Returning on the last available day and will probably not buy again.",
            "review_posted_date": "04 Mar 2019",
            "review_header": "Received faulty device with a known issue many have had.",
            "review_rating": "2.0 ",
            "review_author": "Rodger"
        },
        {
            "review_text": "I purchased this to replace my old Surface Pro 4. This is an excellent product with crisp picture quality. The ONLY objection I have is that it doesn’t come with Office. For the price I would have assumed it yo be included. I couldn’t find any reference to that in the sale page. Had to end up buying it for 1 user for the year at $69.99.",
            "review_posted_date": "23 Jan 2019",
            "review_header": "Great product Office not included though!",
            "review_rating": "4.0 ",
            "review_author": "PMB"
        },
        {
            "review_text": "Great for what i needed. I feel like 16gb of ram would be better for what i need it for, but most people should be fine. Get a screen protector it's worth the money when you don't want to harm the screen that you spent all the money on.",
            "review_posted_date": "25 Apr 2019",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "BarterClub"
        },
        {
            "review_text": "I just set it up but the pen is missing. Please send as it was paid for as part of the package",
            "review_posted_date": "01 Dec 2018",
            "review_header": "Item Missing",
            "review_rating": "3.0 ",
            "review_author": "Edie"
        },
        {
            "review_text": "My grandson loves it!",
            "review_posted_date": "14 Dec 2018",
            "review_header": "It’s a breeze to set up.",
            "review_rating": "5.0 ",
            "review_author": "gwhiz649"
        },
        {
            "review_text": "According to the information given this was supposed to be a Windows 10 Pro OS. Well it does not come with Windows Pro OS like my previous Surface Pro, but Windows 10 Home. If you click the link to the store they want to charge you another $99. Microsoft rip off as usual!! Also better have a fast internet with unlimited data because this does not come with the 1809 feature update to Windows either! Typical Microsoft and their bloatware!!",
            "review_posted_date": "27 Dec 2018",
            "review_header": "Not a Windows 10 Pro OS...",
            "review_rating": "1.0 ",
            "review_author": "The Rabbi Bishop MRBowman"
        },
        {
            "review_text": "Please check, because I didn't receive what I paid for.",
            "review_posted_date": "08 Dec 2018",
            "review_header": "I bought Intel Core i7 and received Intel Core i5",
            "review_rating": "5.0 ",
            "review_author": "NEIL CARDENAS"
        },
        {
            "review_text": "It is excellent device so far. My two major complaints are this device is proprietary meaning Apps that Microsoft does not like have limited functionality apps like hangouts and Alexa. If you buy a Porsche you should be able to buy what ever gas you choose. My second complaint is the device comes loaded with software they have preselected. It wouldn't be so awful if most of this preloaded software didn't expire in 30 days or less. Final comment the best Microsoft program Office is one that expires in 30 days.",
            "review_posted_date": "02 Dec 2018",
            "review_header": "Not a fanboy!",
            "review_rating": "1.0 ",
            "review_author": "Endarkened"
        },
        {
            "review_text": "Great product for me. Was tired of carrying my laptop around and wanted something lighter. This is perfect for me to use for work with spreadsheet and word docs. And then I can easily turn it into a tablet to watch movies or play games.",
            "review_posted_date": "18 Nov 2018",
            "review_header": "Perfect product",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I was happy to see such a reasonable price for a surface pro, i5 128Gig SDD. I wanted to replace my surface pro 4 model with the new, quad core i5 model. But my excitement soon turned to disappointment after setting up the new machine. After receiving the item, I checked the CPU, excited to see my new 4 core CPU. Microsoft and Amazon both state the machine has an i5-8350U; but I was greeted with an old 7th generation Intel processor, the i5-7300U. Shocked, I looked on the back on the device and found the number 1796. Wikipedia states that this corresponds to the Surface Pro 5, with only has a dual core i5. Still in disbelief at receiving an old model after paying for the latest Surface Pro 6, I checked my model number with Microsoft. Sure enough, I have a 5th generation surface pro. I double checked my box. It was factory sealed with stickers and everything. The box clearly states Microsoft Surface Pro 6. It appears someone at the factory is offloading old, unsold merchandise in new boxes, hoping no one notices. Sad and disappointed, I’m sending this back.",
            "review_posted_date": "18 Jun 2019",
            "review_header": "Sadly disappointed – received an older model surface than what I ordered",
            "review_rating": "1.0 ",
            "review_author": "Jeff"
        },
        {
            "review_text": "Be careful to not window shop on this. It looks as the keyboard comes standard by their pictures. NOT! Returned for the laptop version of this product. Very unhappy as this was meant to be a Christmas present. THEN I’m charged a 15% restocking fee ($120) as I’m sure this is what my Daughter was in need of. $120 to re-wrap in plastic. Please. Never turned the thing on! Buyer beware",
            "review_posted_date": "16 Jan 2019",
            "review_header": "Buyer beware - bait and switch!",
            "review_rating": "1.0 ",
            "review_author": "Brad F."
        },
        {
            "review_text": "Be careful and really look at what you received. The surface 6 and Surface 5 are IDENTICAL from the outside. You have to look to make sure you have an 8xxx CPU and not a 7xxx CPU. Also if you bought the i5 version like I did you should have a 620UHD and not a 620HD - the U is important! While it could have been an honest mistake, I have my doubts since they put their sticker over the microsoft sticker on the outside of the box. Returning mine and already received the replacement from another seller (bought the black version to make SURE I got the right version. This also confirmed I received the wrong one.",
            "review_posted_date": "27 Apr 2019",
            "review_header": "Received Surface 5 instead of a surface 6.",
            "review_rating": "1.0 ",
            "review_author": "Gregg L"
        },
        {
            "review_text": "I5 processor 8GB Ram is not enough to for college research. Will slow down drastically going to return ... Over priced for low performance.",
            "review_posted_date": "20 Feb 2019",
            "review_header": "Will max out 8gb ram FAST, performance slows down drastically.",
            "review_rating": "1.0 ",
            "review_author": "Melbin"
        },
        {
            "review_text": "I've been looking for a way to ditch the big box PC and go mobile, and after assessing my real use ond needs I realized I didn't need a lot compared to what's available today vs. 20 years ago when my first PC had a 120 MB MFM drive the size of a small car. I usually get the biggest, fastest most feature packed, everything, that I buy. It's the Boy Scout in me I guess, always prepared for the unexpected. However, after realizing I just couldn't ditch Windows OS just yet in lieu of going all the way Andriod, I had to start looking at 2 in 1's etc. I landed on this, the Surface Pro 6. Next was trying to convince myself I needed to change my ways becasue the truth was, I didn't need an i7, 1Tb $2000+ Surface Pro. I actually heeded advice from reviews and benchmarks showing, nothing I do anymore would ever get me to performance of that machine. So next, after looking and discovering that the 2 Tb drive in my big box PC was only at about 250gb capacity with all the years of crap I had on it. Removing the things I really didn't need to have on the machine itself, like a lot of music, and a documents folder that looked like a decades old closet in a hoarders house, I accepted that I could, for the 1st time, accept the minimum spec machine. So I bought the 256gb machine instead because, well you never know,. And, prices dropped! And Black became available at the same dropped price and was in stock. So here I sit typing on the Burgundy Signature Type Cover attached to my new Surface Pro 6 in matte black, with a black Surface Pen firmly attached to the side of the Surface Pro 6 looking as cool as I've ever thought I could never actually look outside of my head! It looks that good! In just a day or so of setting up, adding my apps and programs starting to get used to being so mobile. So far, it's an easier transition that I thought, but I'll still be making a slow move before pulling the plug on the big box. Is it perfect? No, Windows isn't perfect. There's little things like the task-bar will sometimes seem to retreat and not want to come back out with your finger or pen for a short while, but ctrl-Esc pops it right up. Sometimes it seems like when going to Tablet Mode and back, some of the task-bar items don't show back up or are moved around but also easy to fix and so far nothing that's major. Surprisingly the onscreen keyboard(s) aren't as much of an issue as some report. There are options for what keyboard you want and whether you want to keep it on the task-bar etc. and you can pop it u\\open and close it for when you need or don't need it, in either PC or tablet mode. Overall, I'm really pleased with my new Surface Pro 6 in matte black, i5, 256gb variant with a Burgundy Signature Type Cover and Black Surface Pen. Going from a desk and big keyboard and a 24\" plasma TV as the screen will be a change but so far I can see it being not to bad of a move. I can't always get the Surface Dock and connect it that way if I really need a large screen fix. FYI, for battery life, changing the battery mode makes a big difference. Using max power, makes a few things run smoother and faster as you're expect., like quickly scanning through pictures and videos (like viewing a micro SD card from a game camera quickly skipping past each) but cutting it back to max battery savings also extends it a lot. Some reviews claim battery life isn't near what's advertised, but what's advertised is best scenario and can't account for everyone's usage. I've found the more conservative battery setting is more than enough for most of what I do, with only minor differences when there is a difference. It's a case of YMMV, you're in control of battery life but either way, it's really good! I can't not mention graphics. Wow!! Images are incredible, video, streaming etc. is amazing. It's hard not to want to say it's the best display I've ever experienced.",
            "review_posted_date": "27 Jan 2019",
            "review_header": "I wasn't sure what to expect but I took a chance, and I'm glad I did",
            "review_rating": "5.0 ",
            "review_author": "J. Kennedy"
        },
        {
            "review_text": "Okay I may have been over-excited with the title but hear me out. I had SurfacePro 4, used it for over 2 years when suddenly I too was a victim of the \"Surfacegate Scandal\". It randomly just refused to boot up one day. Lost all my data. Wait. I didnt. Everything important was saved on my mounted SD card. Apparently its a big problem with that model. Anyway... I loved the versatility of the SurfacePro4 so much I immediately started saving up for the Surface Pro 6. Its not cheap. But it is beautiful, adaptable and just such a joy to use! Whens the last time using a gadget made you smile? (No, Rabbits dont count) I have the core i5, 8GB ram variant and it performs everything I throw at it with ease. I use it for photo-editing (Gimp), MS Office, website creation, web browsing, Youtube, movies, music and some light gaming (Hitman absolution). Not once has it stuttered. The pen is a must have if you're into sketching and all that. I personally use it for signatures and marking out points in emails and photos. Pros: - Very responsive screen - Speakers have excellent clarity - Great battery Life (I get over 6 hours with light-moderate use) - Lovely build quality (tho get a cover for it if you want to prevent scratches) - Great functionality in either tablet or laptop mode Cons: - From a physical perspective, its not easy to hold as tablet in one hand, unless you have a case with the strap (Check Targus and Joy) - Lack of connection ports (Only one usb 3.0 port and a mini display port), why guys, whyyy? - The kick stand is great, however its sort of sharp if you use it on your lap while wearing shorts. Overall, great 2in1 device for work and media consumption on the go.",
            "review_posted_date": "14 Jan 2019",
            "review_header": "The only Windows device you'll need!",
            "review_rating": "5.0 ",
            "review_author": "madhu shihab"
        },
        {
            "review_text": "Edit after some hardcore use: I took my Surface Pro out to a client manufacturing facility (they make trucks) for a city water survey. I had it in a Moko case. I was absolutely blown away with a few aspects of this device. I was marking up a very large PDF, a layout of the entire building I was in, complete with all city water plumbing drawn. Zooming, panning, marking up, nothing ended up fazing this device performance wise. I used Drawboard PDF, which was exactly fit for my purpose. I was there surveying for 6 hours, no breaks and no charging. I ended up with 63% battery left! Amazing considering the workload(this was a LARGE PDF)! I really cannot say enough good things about this device. I ended up buying the Surface Pen and it is absolutely worth it over the Ciscle. I don't have a single complaint at the moment about this device. I highly recommend it. Original Review:--- I was debating between a new i5 Pro6 and a refurb i5 Pro 5, until I learned that the new i5 in the Pro 6 is a real 4 core 8 thread. I opted for the 6, and oh boy am I glad I did. Performance wise, it really is kind of amazing that a system this powerful can run on passive cooling. I have been mostly using the Surface to annotate PDFs of building blueprints using Drawboard. Zooming, panning, writing, all of it is as fluid as I could ask for, even on massive PDFs of entire factory buildings. Aesthetically, the Surface is a REALLY handsome device. Very pleasing to the eye, and very ergonomic as well. I love folding down into studio mode for drawing. Drawing is great. I opted for a cheap 3rd party pen(Ciscle), but I think I will probably buy a Surface Pen before too long. It is impressive how little lag there is for drawing, it really does feel very natural. I was debating long and hard with myself whether to get the Surface Pro 6, or just get a cheap windows tablet. 300% price difference, but I am absolutely, hands down glad I got the Pro. Awesome device.",
            "review_posted_date": "17 Nov 2018",
            "review_header": "The new i5 is amazing.",
            "review_rating": "5.0 ",
            "review_author": "Jacob M"
        },
        {
            "review_text": "To provide context, I bought the Surface Pro 6 to replace my Surface Pro 4 which I traded in at my university's tech store. Display: The display on the Surface Pro 6 is noticeably better than that on the Surface Pro 4 for one reason: contrast ratio. The blacks are blacker and everything is just more vibrant. There is also an sRGB color mode for those of you interested in editing photos or videos. In addition, backlight bleed is virtually nonexistent which was a minor issue on my SP4. The display also gets quite a bit brighter than that of the SP4 which helps significantly in outdoor use. Performance: The performance of the SP6 is noticeably faster than that of the SP4 in day to day tasks, mostly due to doubling the cores and threads (4 & 8 vs 2 & 4). Jumping through powerpoint, excel, word, multiple tabs, and even the notorious CPU hog that is Skype was much snappier. Doing a quick Geekbench, the SP6 is in the performance range of a non-overclocked desktop i5 3570k. SSD performance is also very fast, but it still trails behind what Apple is able to achieve. Battery Life: This is the main reason I wanted to upgrade, as the SP4's battery life was its Achilles heel even when it was new. With my mixed workload of web browsing, MS-office, youtube, Onenote, etc., I would get about 4.5 hours of battery life on the SP4. With the SP6, it's about 8.5 hours. Naturally, your mileage will vary depending on your unique use case, but needless to say, the battery is no longer a weak point of the Surface Pro line. Connectivity: This is honestly the flawed aspect of the SP6. The only ports are a headphone jack (thank you!), a surface connect port, a USB A 3.0 port, and a mini-display port. Not having USB C (preferably thunderbolt 3) on a new device in 2018 is going to be a dealbreaker for some. Personally, the surface acts as my mobile machine with a desktop for work at home, so I almost never need to connect it to a display/peripherals. For those looking to use their surface as a primary machine, it may be a dealbreaker; it depends on your workflow. In terms of Wifi performance, I've had no issues. Keyboard and Pen: I'm using the same keyboard and pen that I used with the SP4, because they are forward compatible. The SP6 keyboard is virtually identical to the SP4 keyboard, so my commentary should still apply. The keys have great spacing and travel, and the trackpad, while small, is smooth and accurate. I can't comment on the latest generation Surface Pen, but for those coming to the SP6 with an older pen in tow, you do still benefit from the improved latency of the SP6 compared to the SP4 and older models. It was a pleasant surprise, and writing on the SP6 feels even more natural as a result. The Little Things: Windows Hello is still awesome and faster than ever. With the instant wake of the SP6, I'm in within 2 seconds of tapping the power button. The build quality is also still exceptional. Overall, the Surface Pro 6 feels like a solid upgrade for users of the Surface Pro 4 and older with significantly better performance and battery life. Being able to use older accessories is on the SP6 is just icing on the cake.",
            "review_posted_date": "16 Nov 2018",
            "review_header": "An Excellent Hybrid with a Few Flaws",
            "review_rating": "5.0 ",
            "review_author": "VDaescu"
        },
        {
            "review_text": "This is a solid performer hardware-wise. A truly impressive piece of tech. But not truly useful. First of all, FU Microsoft forcing me to pay $200 extra for an awkward, uncomfortable, poor quality keyboard. The pen is great, kinda... if you use it yes. If you use it rarely, it's just a very expensive thing to rattle around in your laptop bag. Which AGAIN, you have to pay extra for. Ok so, as a tablet it is awesome... right? Yes, right... as a tablet. Not a Windows computer. In tablet mode, so many websites would not scroll for some reason. So many programs were useless because they're not designed for touch. One very notable case being Adobe. The entire Adobe suite pretty much requires a mouse and keyboard to use effectively. Yes, Adobe has touch versions of some programs, but you don't need a $1500 tablet if you're gonna use those. Yes, some Adobe programs, like Indesign have touch modes, but... who uses Indesign? Photoshop and Premier suck on touch, and they're really everything people use. So it's a good laptop! Yes, correct it is a excellent performing laptop. But is a useless laptop. You can't use it on your any better than you can eat dinner while balancing your plate on one finger. The the back stand and afore mentioned overpriced keyboard is. I'll spare you the list of ways you cannot use it and just say, on a table is the only way you will. Needless to say, I returned it and I spent 1/4 the cost on an ultra-thin convertible and SO MUCH BETTER at being a laptop and being a tablet. I will give MS credit. What they packed into that device is freaking groundbreaking. But like a massive mandangle, impressive does not automatically mean useful. The weird thing is they actually made an ultra-thin laptop version of the surface, but the neutered performance for some odd reason so it can't even compete with other u-thins in it's price range.",
            "review_posted_date": "11 Jan 2019",
            "review_header": "It's called surface for a reason",
            "review_rating": "1.0 ",
            "review_author": "Bash Q."
        },
        {
            "review_text": "As a first-time Surface user, I didn't know what to expect. I've been using a Samsung i7 3rd gen Intel laptop for 5 years so my comparison is based on that. The image quality is just gorgeous and top-notch. The audio output is super loud and crisp, not what I expected from a tablet. I don't even need to use a Bluetooth speaker! The build is superb and sturdy. Battery is great, lasts the entire day on Battery Saver and \"Suggested\" brightness but even with the \"Balanced\" and \"Brighter\" setting, it still lasts long. Very responsive (of course it's an 8th gen chip). Windows Hello works well even if the tablet is vertically oriented. Haven't tried games yet except for Asphalt 9 but I haven't detected any hiccups. The lack of USB-C isn't an issue to me. All in all, a great product. The seller is also very speedy in their delivery. I ordered this at the same time as the Type Cover and Pen from a different seller and it arrived earlier than those two. Update: Now that I have the new Surface Pen and Surface Type Cover, this beauty is amazing. I can't imagine reading books and annotating and highlighting without a pen now. The keyboard is very clicky and a joy to type with. The trackpad too is great.",
            "review_posted_date": "10 Nov 2018",
            "review_header": "This first-time Surface user is more than satisfied!",
            "review_rating": "5.0 ",
            "review_author": "Jian Y."
        },
        {
            "review_text": "Lived up to the name , same day shipping and received on time. The laptop is so elegant. Light weight, and the battery life last more than a day. The picture quality is so clear and the sound quality is one of the best. I don't need to use Bluetooth speakers anymore.",
            "review_posted_date": "03 Nov 2018",
            "review_header": "Surface 6 pro",
            "review_rating": "5.0 ",
            "review_author": "Lady B"
        },
        {
            "review_text": "My 3rd surface device: surface 3 had problems w charging USB cable, surface pro 2017 (5) ( have for 1 1/2 yrs, doing great), now surface pro 6 for my wife. Great combination of laptop, tablet & desktop.",
            "review_posted_date": "03 Nov 2018",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "RS"
        },
        {
            "review_text": "Unfortunately because this was bought as a Christmas gift, well before Christmas, I am unable to return it. When my wife opened it, we searched the box for the keyboard. The thing called \"type cover\" is the keyboard! That is not included, and is around $150 extra. Not a huge deal, but then the real issue is that the on-screen keyboard doesn't work most of the time, and requires a reboot to get working again (Yay Microsoft!) Googling for this issue I came across a forum where everyone is upset about this bug and even more upset that its been since reported since September and MS has yet to acknowledge it.",
            "review_posted_date": "10 Jan 2019",
            "review_header": "I hate it. No keyboard included and on-screen keyboard doesn't work.",
            "review_rating": "1.0 ",
            "review_author": "Chad Wilson"
        },
        {
            "review_text": "Image is just stunning, the sound is clear and loud, no distortion at all. The build quality is excellent, looks and feels like a premium product. Computer is very fast, battery lasts a whole day, and it rarely gets a bit warm, and it's completely silent as the Core i5 is fan-less.",
            "review_posted_date": "09 Nov 2018",
            "review_header": "Simply a great device",
            "review_rating": "5.0 ",
            "review_author": "Kenneth Trejos"
        },
        {
            "review_text": "Beware if you are a previous Surface Pro user. ALL Microsoft surface pro computers now come with Windows 10 HOME not Pro; this is not a professional computer. I was unable to install/activate several of my most expensive/existing applications. All the applications will install and run on my Surface Pro 3 and 5. Yes, this computer is fast and works out of the box. Older software (Photoshop6, Photoshop CS3, Office 2016, Acrobat X and others fail to install, activate and run. Support is horrible. The automated phone system will take you to pay for support or hang up on you. The only free support is for activation and they are resistant and ignorant regarding help with system migration questions. I regret purchasing this and wasting 30 hours trying to make it work for my wife.",
            "review_posted_date": "16 Jan 2019",
            "review_header": "Poor support, Windows 10 Home, stops installation and activations of older software",
            "review_rating": "1.0 ",
            "review_author": "Theta"
        },
        {
            "review_text": "I haven't had a need for a full PC in years. I rarely do anything interesting in my leisure computing. I was compelled to buy a Surface Pro when I needed to do tasks outside my work computer that couldn't be fulfilled by my Samsung tablet. I'm pleasantly impressed by this machine. It's the perfect hybrid -- extremely lightweight, highly portable but capable of doing all those things that lazy developers haven't brought to the tablet universe yet. I'm totally sold. I really love this design. It was a bit of an investment (~$1k with the keyboard accessory) but the sting eases as you use it. It's a powerful little travel companion, keeping me well connected on the road. I'll admit. It's not the fanciest machine or the heaviest duty processor but it's a good household machine for when you want some distance to have hobbies outside of your work life. (Admit it. You're using your work computer to read this review...) Plus these days if you really need advanced compute, you can use an AWS workspace to spin up the right machine for that specific task and spin it down. Overall, I'm converted. I can't imagine not having this machine in my arsenal. I feel like a wizard. I'm much more organized and productive having a machine that's capable of being both a tablet and a legitimate PC. Huge win in my book.",
            "review_posted_date": "08 Dec 2018",
            "review_header": "A perfect hybrid, designed for convenience",
            "review_rating": "5.0 ",
            "review_author": "Kristin"
        },
        {
            "review_text": "I love this. I know it's got reviews with complaints about certain things. The only thing it used to do was flicker when plugged in for a while but I havent seen that in over a month. It does everything I need it to from video editing, to drawing, to note taking and even light gaming. The sound is great and I love watching shows or YouTube videos on it. It's also great for reading a kindle book.",
            "review_posted_date": "18 May 2019",
            "review_header": "Love mine",
            "review_rating": "5.0 ",
            "review_author": "K Ack"
        },
        {
            "review_text": "This is a great computer, I really like it. It's perfect as a sort of around-the-house computer (as opposed to the one in my office, etc). The only downside is the battery life really leaves a lot to be desired.",
            "review_posted_date": "17 Apr 2019",
            "review_header": "Great little computer",
            "review_rating": "5.0 ",
            "review_author": "Kvetchus"
        },
        {
            "review_text": "I had the i5, 8GB RAM, 256GB storage version for work. When my personal computer died I decided I would replace it with a SurfacePro. I had not seen one all black, so it was a bit different and with the increased specs (i7, 16GB RAM, 500GB storage) I have been able to load everything I had on my previous computer and run so much faster. Very happy with this unit",
            "review_posted_date": "16 Jul 2019",
            "review_header": "Light, thin and travels well",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I received my replacement an immediately contacted Microsoft to ensure that this devise is okay after my initial purchase had hardware issues. Thos device is off the chain awesome in term of performance. To all who read my review, Microsoft is there for you. Great customer service. Kudos to Amazon technical team who reached out to me seconds after I scheduled a return.",
            "review_posted_date": "07 Jan 2019",
            "review_header": "Great Machine!!!!...latest greatest.",
            "review_rating": "5.0 ",
            "review_author": "MelMac"
        },
        {
            "review_text": "The touch keypad is transparent and does not work. Based on what I learned from MS support threads, this is a common hardware issue that MS has not acknowledged. So, plan to buy a separate keyboard and not ever use this as a tablet. To quote Conan O’Brien, MS chose the name “surface” because it’s a nice place to put your iPad",
            "review_posted_date": "05 Mar 2019",
            "review_header": "Touch keypad does not work",
            "review_rating": "1.0 ",
            "review_author": "Buyer1"
        },
        {
            "review_text": "First windows device in a decade, and very happy with it. Using it as a secondary computer/tablet along with my MacBook Pro. Awesome kickstand, typecover is sold separately and fairly expensive (which is a bummer when things are sold separately like that) but definitely needed and provides an awesome typing experience. Definitely glad I pulled the trigger on this product over a iPad and highly recommend it!",
            "review_posted_date": "28 Jun 2019",
            "review_header": "Awesome hybrid tablet PC",
            "review_rating": "5.0 ",
            "review_author": "I.S."
        },
        {
            "review_text": "Love the Microsoft Pro 6! Small package that packs a lot that allows you to do everything needed for business or personal use. Love the ease of mobility of the unit! Can carry around with ease!",
            "review_posted_date": "03 Jul 2019",
            "review_header": "Operating system allows mobility without breaking your back with a traditional laptop! Great value!",
            "review_rating": "5.0 ",
            "review_author": "Will"
        },
        {
            "review_text": "LOVE IT! I use this every day for work, it makes everything so much easier on the digital marketing side and for our customers and vendors. Fast and user-friendly",
            "review_posted_date": "14 Dec 2018",
            "review_header": "LOVE IT! I use this every day for work",
            "review_rating": "5.0 ",
            "review_author": "Sharis White"
        },
        {
            "review_text": "I bought this three months ago. I am already have problems with the charger. Microsoft had me in a chat for an hour just to say that the fast they can get me a new charger under the warnety is a week. So now I can not use the $1000 tablet and parts for a week. Microsoft does not know what customer serivce is buy from a different company.",
            "review_posted_date": "19 Jun 2019",
            "review_header": "Do not buy Microsoft",
            "review_rating": "1.0 ",
            "review_author": "cjg085"
        },
        {
            "review_text": "Touch screen lags ALOT. The keyboard is broken the connecting part to the screen is loose and detached from the keyboard and gets stuck in the screen. It broke the keyboard sensor. Never buying electronics from Amazon",
            "review_posted_date": "05 Jul 2019",
            "review_header": "KEYBOARD IS TRASH",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I did plenty of research before I purchased Microsoft Surface Pro 6 (including Lenovo, Dell & Samsung), once decision made I checked online vendors and decided on Amazon and Beach Camera. Their pricing and bundling of Type Cover and Pen for Surface Pro 6 beat out all the other vendors. I replaced a Lenovo tablet with this Microsoft tablet and so far Microsoft is a superior product (Touch Screen & Keyboard Cover). Quality Product and Vendor!",
            "review_posted_date": "25 Mar 2019",
            "review_header": "Ordering - Pricing and Quality Products",
            "review_rating": "5.0 ",
            "review_author": "J. Perez"
        },
        {
            "review_text": "I've just been blown away with the performance that they pack into these things. I've owned a lot of devices over the years but this is the first one that packs full desktop performance into a tablet form factor. Being able to have the tablet experience when I want it and a fully functional Windows machine when I need it all in the same device is fantastic. I also bought the dock for a true desktop experience when I'm at my desk and it's pretty much perfect.",
            "review_posted_date": "25 Apr 2019",
            "review_header": "I love this computer!",
            "review_rating": "5.0 ",
            "review_author": "Tyson"
        },
        {
            "review_text": "I really like the changes to the Surface. It is easy to set up and has good response time for the things that I do with it. I love the upgrade.",
            "review_posted_date": "20 Feb 2019",
            "review_header": "Upgrade from Surface 2",
            "review_rating": "5.0 ",
            "review_author": "Raryl"
        },
        {
            "review_text": "Have to say that overall I was pleased with my Surface Pro and keyboard (Cover). One piece of feedback for the folks at Amazon is that it would be very helpful to make it clear that the keyboard does not come with the Surface Pro. Also, when I looked for the keyboard on the site it's described as a \"cover\" and wasn't immediately obvious that they were referring to the keyboard. Eventually was able to figure that out by viewing the product picture.. Only other point is that I was disappointed that apparently Amazon hasn't seen fit to release a Windows 10 app for Prime Video. Did read a less-than enthusiastic review from 2016 announcing it's release but couldn't find it in the MS Store. This is not just specific to the Surface Pro but is related to the OS. Again, otherwise pleased with my SurfacePro as a hybrid solution which is exactly what I was looking for. Would definitely recommend it to anyone else who has similar requirements.",
            "review_posted_date": "14 Jul 2019",
            "review_header": "MS Surface Pro and Cover",
            "review_rating": "4.0 ",
            "review_author": "Perry Pitzele"
        },
        {
            "review_text": "Replaced my Asus with this one. Wow. Super fast, ergonomically brilliant, great display, and one of best keyboards I've used. I type close to 90 words per minute and rely on comfortable, responsive keyboards. While the keyboard is an add-on, I think it is one of the best qualities of the Surface. The way it folds up and detaches/reattaches is outstanding. The unit folds up to a wafer-thin and lightweight package. I just carted it all over Greece for two weeks, in a small daypack. Well worth the cost!",
            "review_posted_date": "18 Jun 2019",
            "review_header": "Best Tablet Out There",
            "review_rating": "5.0 ",
            "review_author": "NPR Guy"
        },
        {
            "review_text": "My first Surface Pro had an issue where the battery bulged and the screen popped out. It was out of warranty. When I contacted Microsoft, they decided to replace my computer free of charge. It was such a smooth and easy transaction. The Surface Pro is the best laptop I've owned. It starts up in seconds, almost an instant on. It is super light weight. Doesn't lock up or hesitate. I just really like it.",
            "review_posted_date": "14 Apr 2019",
            "review_header": "Surface Pro is a great computer",
            "review_rating": "5.0 ",
            "review_author": "Michael L."
        },
        {
            "review_text": "It's pretty much what i expected. I have been using it almost every day for a month and i can say it performs as it should, it has never crashed, it turns on quite fast and the applications are quite fluid. I have to say that I use it mainly for web browsing and MS Office related tasks. The touch screen works pretty well when using my fingers, I wish the screen was a little bit bigger but that's not really such a big deal. However, the only thing I wish was done better is the responsiveness of the MS Pen. Sometimes I would be writing on the screen usen the MS Pen and the side of hand would come into contact with the screen and that would mess up what I was writing. This is frustrating considering that the apple pencil and the ipad pro solved this issue years ago.",
            "review_posted_date": "19 May 2019",
            "review_header": "I love it (on laptop mode) but could be better",
            "review_rating": "5.0 ",
            "review_author": "Guillermo Cervantes Brown"
        },
        {
            "review_text": "This thing is a beast. Way more than I need for what I bought it for. I love it. I will probably never buy a laptop again. I use photoshop elements for light editing and resizing and it handles it great. I use it for displaying my reference photos when I draw and it does more than I need. Great screen. I like the touch sensitivity and might get the add on pen from Microsoft to up its game. Very satisfied",
            "review_posted_date": "29 Apr 2019",
            "review_header": "Fantastic machine!!!!!",
            "review_rating": "5.0 ",
            "review_author": "Joe"
        },
        {
            "review_text": "Mejor de lo que pensaba",
            "review_posted_date": "14 Feb 2019",
            "review_header": "Excelente",
            "review_rating": "5.0 ",
            "review_author": "Raúl"
        },
        {
            "review_text": "I have had a Surface in my life for years now and as the time came to get a new device, there was no doubt in my mind as to what. I am absolutely in love with my new surface and everything it can do. Great battery life for internet and daily activities, though I will say things like photoshop drain it quicker than I'd like. Still, as a wroter, I cant beat out a battery that lasts this long when I'm just writing.",
            "review_posted_date": "29 Apr 2019",
            "review_header": "Love it!",
            "review_rating": "5.0 ",
            "review_author": "Anon"
        },
        {
            "review_text": "I've been quite impressed with this machine so far. The bootup and shutdown times are excellent. Running 8GB so far has not been an issue, and I've been analyzing data with R, Python, and SQL with no issues. Lightroom and photoshop editing are no problem, though I haven't tried video editing yet. In fact, it runs faster than my 16GB 6th Gen i7 notebook, comparatively speaking. The screen size and quality are excellent. I've paired mine with the Microsoft Type keyboard and Surface pen, and I find both very useful and easy to use. I chose the 128GB hard drive and added a 200GB class 10 microSD card for $25. Much less expensive option than upgrading the HD size to 256GB, though performance is slightly lower with the microSD card when I'm crunching large datasets. Overall 5 stars in my book.",
            "review_posted_date": "23 Apr 2019",
            "review_header": "This 8th Gen i5 Surface Pro 6 Rocks!",
            "review_rating": "5.0 ",
            "review_author": "DocRock"
        },
        {
            "review_text": "I will point out some minor things first: for Google websites, like Google docs, Google Sheets, it can take a while to load up first and their websites are not so touch-friendly, plus there is a lack of official Google apps in the store, take note if you rely on those heavily. (I bet my device this is because Google wants to promote their Chrome OS) Bring the charger with you if you plan on using it for like 8 hours because without power save (which can affect you performance and touchscreen) it wouldn't last so long. I would say that is understandable consider how much stuff is already packed in this device. Plus the charger is really mobile device charger weight. But besides all those, it's indeed a 2-in-1 that packs all the functions of a laptop in a tablet weight device, I can run all my apps (like MATLAB, mingw) and do some painting (with clipstudio) with this thing. It makes my works seem more fun than they were. It feels like my productivity improved. For the entire week I spent more time concentrated in my work and didn't touch my other laptop at all. I wouldn't say it is the best device yet to exist, but it is definitely one of the best things our current consumer technology can offer.",
            "review_posted_date": "06 Apr 2019",
            "review_header": "Very productive",
            "review_rating": "5.0 ",
            "review_author": "Jon Zhao"
        },
        {
            "review_text": "If you're thinking about buying one of these just do it... I have the platinum surface pro 6 128gb with platinum keyboard type cover. Bought a 256gb sd card as well for it. The size is perfect of this thing. It's very very easy to type on. You still get a full track pad on the keyboard. The screen quality is amazing. The device is very snappy to be a laptop. The battery life can be stretched depending on what you're doing with it. I used it the past 3 days at a seminar where I only needed to take notes so therefore I didnt need internet or to have it on a high performance power setting. Litterally after using it taking notes using one note for probably 10 hours in a day i was still left with at least %60. I dont have the surface pen but will be getting one. I'd recommend this device to anyone.",
            "review_posted_date": "11 Mar 2019",
            "review_header": "AMAZING. BEST OUT THERE!!",
            "review_rating": "5.0 ",
            "review_author": "Logan l blackwell"
        },
        {
            "review_text": "I could not load any of the software needed for my work. Windows defender kept stating this could harm your computer and blocked it. What’s interesting I have a Surface Pro 3. No problem running on that one. Also Microsoft soft states Windows Surface Pro . But is comes with Home not Pro. That’s a 99.95 upgrade. My Surface Pro 3 came with Pro .",
            "review_posted_date": "09 Jan 2019",
            "review_header": "Disappointed. Not what it’s advertised",
            "review_rating": "3.0 ",
            "review_author": "eric"
        },
        {
            "review_text": "Had programming problems. Spent several hours on line trying to get it to work.",
            "review_posted_date": "14 Feb 2019",
            "review_header": "Product seems to be good. One of those things you couldn’t know about when ordering.",
            "review_rating": "1.0 ",
            "review_author": "William w Woodworth III"
        },
        {
            "review_text": "Despite a concerted effort by the shipper to package this unit as self-destructively as possible, this computer arrived in excellent condition! The same cannot be said box it came in, which was clearly at one point run over by an underwater forklift. Surely, you may say, no one has enough time on their hands to arrange such an endeavor! I humbly offer that the six week journey to my home provided ample time. Such is the battery life that it still booted up immediately! Fortunately for all, Microsoft apparently seals their products in such a way as to foil even the most deliberate sabotage. I have not yet tested it at the gun range, but fully expect that, if I do, the screen quality is such that it would simultaneously reflect calibers sizes up to .308 while also inexplicably improving my aim.",
            "review_posted_date": "20 Mar 2019",
            "review_header": "Extremely durable!",
            "review_rating": "5.0 ",
            "review_author": "Jessica"
        },
        {
            "review_text": "I have been in Mac’s for 10 years. My MacBook PRO is a 2009, and is at it’s end of life. But Macs have so expensive, I decided it was time to move back to windows. This is my first windows machine since they had Vista!! But I’m loving this computer. Mac’s still can’t handle hand writing , and have no touch screens. After using this computer for a week, I wish I had come back a long time ago!",
            "review_posted_date": "15 May 2019",
            "review_header": "1st Windows computer in 10 years, Loving it!!",
            "review_rating": "5.0 ",
            "review_author": "Paul Murray"
        },
        {
            "review_text": "Even though i got the weakest model (i5 128gb 8gb ram) It is a truly amazing experience! I debated for months which windows tablet to get for school and i realized this one was the best for me. It is somehow even better than I hoped. As soon as I can afford it( a yr or two) , i plan on getting the maxed out surface 6 so i can pass this one down to my daughter. I find it very likely I will be a surface customer for life.",
            "review_posted_date": "16 Feb 2019",
            "review_header": "My favorite computing experience",
            "review_rating": "5.0 ",
            "review_author": "William"
        },
        {
            "review_text": "I've used the Surface Pro 6 for a few months now and I love it. Battery life is spectacular. It is light enough to carry through the airport with the keyboard still the right size to actually tye versus tablet. I did have a bit of a time getting a bridge to connect to so as to have multiple USB ports, HDMI, etc. I did find one for about $40 and it came with a USB-C. I got a simple USB-C to USB-A adapter (2 for $7 from Amazon) and I'm all set.",
            "review_posted_date": "16 Apr 2019",
            "review_header": "Just what I'd hoped for.",
            "review_rating": "5.0 ",
            "review_author": "ChefSparky"
        },
        {
            "review_text": "These are not 5 stars, but then no model I know of in this category that is, your making trade off's for the convenience and versatility. Bought for granddaughter because she wanted a slate she could draw on, this has the versatility of being able to use it as a small computer at a decent level of performance. This crosses all the T's, I debated between the Mac and this, but in the end this was more like a computer, with a four core processor, I do not do 2 cores, there is just too much trade off. Mac does very well with this, but still introduces hiccups on the internet. t",
            "review_posted_date": "11 Jan 2019",
            "review_header": "Crosses all the T's.",
            "review_rating": "5.0 ",
            "review_author": "Billy Davenport"
        },
        {
            "review_text": "Excellent product, you have in this device a laptop and a tablet. I'm architect and I think it is the best for me because I can install Adobe products with any problem. Also you can find many apps in the Microsoft Store and it's very good.",
            "review_posted_date": "24 Feb 2019",
            "review_header": "Excellent product!",
            "review_rating": "5.0 ",
            "review_author": "Agnes Sevilla Medina"
        },
        {
            "review_text": "The only thing it lacks is a USB-C port. This is a solidly built computer and it's extremely responsive.",
            "review_posted_date": "03 Dec 2018",
            "review_header": "Great computer!",
            "review_rating": "4.0 ",
            "review_author": "Brook"
        },
        {
            "review_text": "I do feel as though this is a bit overpriced especially when you add in the pen, the keyboard, upgraded RAM & Memory, as well as a protective case but it checks off most of my wishlist- fast, Win10, good battery life, great note taking pen, solid build, not too big and not too small (a little less weight will always be nice), great display. It has features that I probably will not even use but it is always nice to have. I use the pen mainly for note taking which does not disappoint. The pen is responsive and there are no problems with my palm touching the screen while writing. The keyboard is nice but you have to research protective cases that accommodate it being connected and that also allow full use of the great kickstand that the Surface has. The ports are limited (no usb-c as everyone knows) but I knew this going in and it does not affect my use. BOTTOMLINE- buy what suits your personal needs. There are cheaper alternatives that may lack some of the power or display quality & size etc. but you may not need that stuff for your use and you can save some money- the Surface GO may be a good alternative. Also, there are always bundle deals with the keyboard and pen to look out for.",
            "review_posted_date": "22 May 2019",
            "review_header": "BUY IT IF IT SUITS YOUR NEEDS",
            "review_rating": "4.0 ",
            "review_author": "Alvo"
        },
        {
            "review_text": "For perspective on this review, I've been a Mac user since college, which for me is half a lifetime. My motivation in getting a Surface is pretty simple: I wanted a tablet for my \"casual\" usage around the house, but I still require full \"normal PC\" functionality, including the need to put the device into \"desktop\" mode. I didn't want to have to own two separate devices, and as Apple has made very clear, they are never going to offer a convertible. Even the new iPad-specific iOS version is not going to provide a true PC-like experience, nor the capacity to attach an external display. For those reasons I decided to go ahead and make the switch. Another weird side note: professionally I am a .NET systems architect, so I use Windows at work all day every day, and live in a very Microsoft world. So I'm used to using Windows, yet have never really liked it for my personal use, at home. With all that as background, I really don't have anything but praise for the Surface Pro. I don't quite understand what all the detractors are on about, honestly. It works great -- performance is excellent, as is the design and build quality. It switches very nicely to desktop mode, and works very well as a laptop replacement. The display quality, in particular, is excellent -- better than my 2016-era MacBook Pro. There are a few frustrations, of course: it's Windows OS, so that in and of itself comes along with a list of complaints. But those are all workable, and these days the OS honestly doesn't matter all that much. Windows 10 can be configured to stay pretty-much out of your way, and for me, I never really even notice what OS I'm using, any more. The iteration I purchased is the i5/8GB RAM/256GB SDD. Even as a developer and as someone who dabbles in some higher-performance photo/graphics editing, that model delivers all the performance I need -- even while driving a quad HD external monitor. The device is totally fanless, so there is absolutely no noise at all from it, which is something I really appreciate a lot. I had previously tried to switch to one of Lenovo's convertible tablets, and the fan noise drove me half crazy -- I couldn't do it, and sold the device within a week; went back to my MacBook. This time I do believe the switch is permanent. And as to that, I have to say that I don't know what Apple could possibly be thinking by not offering a convertible tablet. They've lost a lifelong customer in their stubbornness, and I doubt I'm the only one. Microsoft really has a winner on their hands with the Surface Pro. So far I really like it. I'm giving the Surface Pro 4 instead of 5 stars because there is still a lot of room for improvement. As many other reviewers have pointed-out, it's really not acceptable in 2019 to offer a device with a single, standard USB 3.0 port, and no USB C. This doesn't impact me, personally, too much, but it's still a serious drawback, generally, and I get why people are upset by it. There are also some perplexing and truly frustrating oddities in terms of switching between tablet versus desktop mode in Windows 10. For me, I don't even really see the point of having the two modes at all. Overall, though, I wouldn't hesitate to recommend the Surface to just about anyone.",
            "review_posted_date": "07 Jul 2019",
            "review_header": "A solid laptop replacement",
            "review_rating": "4.0 ",
            "review_author": "Michael"
        },
        {
            "review_text": "I originally got this Surface Pro after agonizing for a while over whether I should get this, or a different laptop + a drawing tablet, as this was what I mainly wanted it for- Digital art. I had my heart set on getting a drawing tablet, but how portable this was with it still being a full computer is what led me to purchase this. I am pleased overall so far, the Surface Pen works quite well with it in using it for art. I have only doodled with it a little bit so far as the Christmas season has made life crazy, but I may update my review at a later date when I have used it more. Excellent battery life for what I use it for so far.",
            "review_posted_date": "26 Dec 2018",
            "review_header": "So far, so good!",
            "review_rating": "5.0 ",
            "review_author": "Christine Ginn"
        },
        {
            "review_text": "After receiving my Surface Pro 6 (4GB) version, after installing Microsoft 360 and playing around with OneNote, the system locks. You need to hold down the power button for 15-20 secs, to get it to manually reboot. I opened a web browser and was listening to YouTube TED talk, and was checking Outlook mail, and the system locks-up (freezes) again. This has happened 4 times in the last 3 hours. I've run the Surface Diagnostic Toolkit with no errors found. I went into the System Event logs to find a number of Event ID error codes one of the most concerning is the ID37 Kernel error which might be an issue with the processor or an unbalanced Firmware update to the software which handles how the power consumption is regulated with the processor. Regardless, I called MSFT tech support and spent an hour with the India help desk. Let's just say that it was an extremely frustrating experience. This is my first experience to the Surface and I can tell you with 3 years having worked at Microsoft and going through this type of experience this has to be one of the worst customer experiences that I've had in several years. Do yourself a favor and look into buying a Apple iPad.",
            "review_posted_date": "02 Jun 2019",
            "review_header": "WARNING: Don't purchase",
            "review_rating": "1.0 ",
            "review_author": "James Meadows"
        },
        {
            "review_text": "--First Review-- 04/30/2019 Came some 5 hours before the promised time. Excellent Package. Perfect and beautiful. Nothing missing. No scratches. --Second Review-- Returned it. Lagged when scrolling up and down. Pro Prime seller kept saying on emails and even on a letter after I applied for a return things like: \"if you do not do a factory reset which our techs will be testing for, I will not provide a refund. Sent me 4 emails like this and then the letter...it was aggravating, instead you can say...when our techs run tests on it, we will do our best with a refund, or something like that...you would be stating the same thing as before, but not in a condescending, and aggravating way :/ Actually I was going to order the i7, but with several negative written comments I realized that doing that would not be the wisest thing",
            "review_posted_date": "30 Apr 2019",
            "review_header": "Microsoft Surface Pro 6 (Intel Core i5, 8GB RAM, 256 GB) - Black Newest Version (KJT-00016)",
            "review_rating": "3.0 ",
            "review_author": "Adrian Centeno"
        },
        {
            "review_text": "So my old laptop finally called it quits on me and I knew I needed a new one. But there are just so many options. I eventually started leaning towards the 2-in-1 laptops as I liked the freedom it provides. I was concerned however that it would not have the power to do what I needed it to. I am a budding graphic designer and web designer and I needed to run some programs on it that meant I needed more power than the average person who is just surfing the internet. I eventually took the leap and purchased this laptop and I have had no regrets. I bought the pen and keyboard that match it and then I bought a INFILAND cover to go with it. They all work wonderfully together and I can easily use this laptop while sitting at an office desk or as a tablet while lounging on the couch. I have not had any struggles running the programs I need on it. I will acknowledge that I don't have a ton of stuff downloaded on it, I keep my files on an external hard drive and in the cloud and I dont have a bunch of games on it or anything, only the programs I need for my work. The laptop seems to be well worth the price to me and I like how easy it is to move around with it. It is so light and compact. My last laptop was a 15 inch screen HP Pavilion and it is so bulky compared to this. I have already used this laptop more on a daily basis than I ever did my previous laptops as it is easier to sign in(i even have facial recognition set up onthe laptop so the moment it sees me sitting in front of it it automatically signs in), and i find it so convenient to be able to easily carry it wherever I go.",
            "review_posted_date": "05 Jul 2019",
            "review_header": "This was a great decision...",
            "review_rating": "5.0 ",
            "review_author": "M. Wilde"
        },
        {
            "review_text": "Its like having a desktop size of a tablet! Does everything a desktop can do and more! The screen writing feature makes filling out and signing forms amazing! work from anywhere!",
            "review_posted_date": "19 Dec 2018",
            "review_header": "Best Computer Ever!",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I bought this as I wanted something powerful that was also portable and light to carry. I bought the keyboard that goes with it, which is vital for using it like a computer. Didn't get the docking station. I love this Surface, it's fast and responsive, and it's very compact and easy to transport. The battery life lasts for quite a while just using basic functions such as MS Office tools and surfing the web. I haven't tried it yet with more power intense applications like Photoshop and Adobe Premier, but I assume it will last less long with these tools as they use more processing power. All in all very happy with this purchase and the performance. It was more than a standard laptop, but the portability, reviews, and processor/memory specs were better and more robust.",
            "review_posted_date": "20 Mar 2019",
            "review_header": "LOVE IT",
            "review_rating": "5.0 ",
            "review_author": "LindsayC"
        },
        {
            "review_text": "Total screen lag in design apps due to lack of any real gpu and lack of ability to connect external gpu",
            "review_posted_date": "04 Apr 2019",
            "review_header": "Don’t buy. Screen lag",
            "review_rating": "1.0 ",
            "review_author": "Luke"
        },
        {
            "review_text": "Great laptop. Good quaility. The screen is fantastic. Good speed with their ssd disk. Maybe overpriced.",
            "review_posted_date": "02 Feb 2019",
            "review_header": "Best portable laptop",
            "review_rating": "5.0 ",
            "review_author": "James"
        },
        {
            "review_text": "Highly recommend the Surface pro for business applications.",
            "review_posted_date": "14 Apr 2019",
            "review_header": "Awesome System for Business",
            "review_rating": "5.0 ",
            "review_author": "CodeBlue Networks"
        },
        {
            "review_text": "Bought for my son to do art on it. He loves it",
            "review_posted_date": "19 May 2019",
            "review_header": "Great computer",
            "review_rating": "5.0 ",
            "review_author": "hortencia"
        },
        {
            "review_text": "Starts up quick and ready to go. Really like everything there is about my Surface Pro 6.",
            "review_posted_date": "25 Jun 2019",
            "review_header": "Works straight from unpacking.",
            "review_rating": "5.0 ",
            "review_author": "David D."
        },
        {
            "review_text": "Refuses to give me my keyboard. Soft keys are useless. Very frustrating",
            "review_posted_date": "12 Mar 2019",
            "review_header": "Defective",
            "review_rating": "1.0 ",
            "review_author": "Jim Harbourne"
        },
        {
            "review_text": "I went from a 15.6\" HP Envy to a 12.3\" Surface Pro 6. I was afraid the smaller display would be an issue for me (I'm 71), but it isn't as it has a denser display and the pictures are bright and clear. The PC is lightning fast and I really like the face recognition for logging in. Overall, I am impressed with the new Surface Pro 6.",
            "review_posted_date": "31 Jan 2019",
            "review_header": "My Surface Pro 6 is a great PC!",
            "review_rating": "5.0 ",
            "review_author": "KitKat"
        },
        {
            "review_text": "In the first time I turned on the screen, I didn't take it in time. I restarted and found that there was no screen phenomenon and it worked fine. I hope that this device can be used without some problems.",
            "review_posted_date": "01 Mar 2019",
            "review_header": "Still satisfactory transaction",
            "review_rating": "5.0 ",
            "review_author": "Out-Man"
        },
        {
            "review_text": "Very happy, but costly.",
            "review_posted_date": "20 Apr 2019",
            "review_header": "Versatile",
            "review_rating": "4.0 ",
            "review_author": "dostoevsky"
        },
        {
            "review_text": "Can't get along with out it",
            "review_posted_date": "04 Jun 2019",
            "review_header": "Use it every day",
            "review_rating": "5.0 ",
            "review_author": "AMZN"
        },
        {
            "review_text": "Orders the 256gb version of the surface pro. Received the 128gb instead. It was a gift for my boyfriend before he went out of state for a semester, so can’t send it back and get a new one. Laptop is great, runs a bit slow compared to my 128gb surface pro I bought at Best Buy.",
            "review_posted_date": "06 Jul 2019",
            "review_header": "Wrong order",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I prefer Surface Pro tablets to all others for both work and personal use.",
            "review_posted_date": "16 Feb 2019",
            "review_header": "Surface Pro tablets are the best",
            "review_rating": "4.0 ",
            "review_author": "Erin Chester-Bradt"
        },
        {
            "review_text": "My wife uses this for video ASL interpreting. The camera and screen quality is excellent. Battery life is great and the device is very portable. No complaints.",
            "review_posted_date": "10 Apr 2019",
            "review_header": "So far so good.",
            "review_rating": "5.0 ",
            "review_author": "Kindle Customer"
        },
        {
            "review_text": "I discover New features every time.",
            "review_posted_date": "18 Dec 2018",
            "review_header": "Fin tu work with",
            "review_rating": "5.0 ",
            "review_author": "E Quinonez"
        },
        {
            "review_text": "The product is excellent. HD quality is awesome. Light weight. There is a slight heating issue on long usage . Secondly, feedback for seller - The packaging was not that good specially considering the cost and fragility of the item. It could have been much better.",
            "review_posted_date": "19 Feb 2019",
            "review_header": "Excellent product",
            "review_rating": "4.0 ",
            "review_author": "MickyMouse"
        },
        {
            "review_text": "I bought it for my daughter. Fast like lightning.",
            "review_posted_date": "08 Jan 2019",
            "review_header": "Great product",
            "review_rating": "5.0 ",
            "review_author": "Georgi Mihaylov"
        },
        {
            "review_text": "Great size for travel and easy to navigate.",
            "review_posted_date": "06 Dec 2018",
            "review_header": "Easy to use.",
            "review_rating": "5.0 ",
            "review_author": "Lynne B. Winterton"
        },
        {
            "review_text": "Just getting used to it but so far works great. Ready to go out of the box. Love the pen.",
            "review_posted_date": "27 Apr 2019",
            "review_header": "Great Laptop",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "This has the older 2 core i7 instead of the 4 core i7. It is however, a good buy at just under $1185, but you might find a better deal on a Surface Pro 5 i7 which would be similar in performance.",
            "review_posted_date": "30 Jun 2019",
            "review_header": "Not \"Newest Version\"",
            "review_rating": "3.0 ",
            "review_author": "jac"
        },
        {
            "review_text": "I'm happy with my surface pro6 its nicer than my pro 4 and I bought a screen saver as my old one screen cracked so I'm hoping I don't have that problem, so far so good",
            "review_posted_date": "04 Jun 2019",
            "review_header": "Its a REAL MICROSOFT....",
            "review_rating": "5.0 ",
            "review_author": "Debbie Rowe"
        },
        {
            "review_text": "Just awesome. The third Surface in our home. Wife even gave up her MacBook for the Surface. Nothing else compares.",
            "review_posted_date": "17 May 2019",
            "review_header": "Truly awesome",
            "review_rating": "5.0 ",
            "review_author": "David Duty"
        },
        {
            "review_text": "Great product. I omned the 3rd gen at one point as well. Still have issues with the mouse. Right click sporadically has issues. My 3rd gen one broke completely.",
            "review_posted_date": "28 Jan 2019",
            "review_header": "Great but not a fan of the keyboard",
            "review_rating": "4.0 ",
            "review_author": "Rob"
        },
        {
            "review_text": "La utilizo para el trabajo Y para ocio, la verdad ofrece lo mejor de los 2 mundos, no en vano es la mejor tablet-pc (híbrida) del mercado",
            "review_posted_date": "19 Jan 2019",
            "review_header": "Trabaja excepcionalmente bien",
            "review_rating": "5.0 ",
            "review_author": "Julio Velasquez"
        },
        {
            "review_text": "Perfect for students with the versatility and power. This surface is powerful and adapts to any situation you throw at it. The surface should be used as a second computer. If you're thinking about getting it, just do it! The only downside is a keyboard is a must, and the pen is recommended if you plan on taking notes or drawing.",
            "review_posted_date": "01 May 2019",
            "review_header": "Amazing",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I received a generation 5 not a Surface Pro 6. When we went to register with Microsoft they informed us it is a generation 5. Lost half a day installing software on a product i did not buy! Sent it back and bought one from best buy to make sure this did not happen again. When i spoke to Amazon customer service they said that they could not confirm it would not happen again.",
            "review_posted_date": "04 Jul 2019",
            "review_header": "Not a Surface Pro 6 but a generation 5",
            "review_rating": "1.0 ",
            "review_author": "Thomas A. Dotson Jr."
        },
        {
            "review_text": "I just register the surface with Microsoft and is not a surface pro 6 (latest model) but a surface pro 5. I paid for a surface pro 6. I hope they can fix this problem and not charge me extra for their mistake.",
            "review_posted_date": "22 Jun 2019",
            "review_header": "Check what you get...",
            "review_rating": "1.0 ",
            "review_author": "Mayra"
        },
        {
            "review_text": "I think surface pro most best device can be as tablet and functional laptop at same time , very responsive thanks to core i 5 processor and SDD , I use it as primary PC everyday , to issue be spotted ,,, I highly recommended to university students with surface pen",
            "review_posted_date": "13 Feb 2019",
            "review_header": "brilliant device",
            "review_rating": "5.0 ",
            "review_author": "Abdulaziz Tibar"
        },
        {
            "review_text": "I love everything about my surface pro 6. I’m still learning a few things but so simple to use! It’s so thin and lightweight!",
            "review_posted_date": "01 Jan 2019",
            "review_header": "Great!",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "This was a replacement for my husband's earlier version of the Surface Pro. He loves this computer and it takes care of all his needs.",
            "review_posted_date": "23 Feb 2019",
            "review_header": "Great Computer!",
            "review_rating": "5.0 ",
            "review_author": "Peggy Fitzpatrick"
        },
        {
            "review_text": "Its more difficult for a novice like me to load icons and programs",
            "review_posted_date": "20 Dec 2018",
            "review_header": "Nothing",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Highly recommended.",
            "review_posted_date": "10 Jun 2019",
            "review_header": "Highly recommended.",
            "review_rating": "5.0 ",
            "review_author": "Marco Palma"
        },
        {
            "review_text": "My favorite lap top / tablet",
            "review_posted_date": "18 Jan 2019",
            "review_header": "Nice 5 Star Product",
            "review_rating": "5.0 ",
            "review_author": "David Edgin"
        },
        {
            "review_text": "the surface has good picture quality and touch screen is great",
            "review_posted_date": "27 Dec 2018",
            "review_header": "there both good just depeneds on how much you want to spend",
            "review_rating": "5.0 ",
            "review_author": "Charles Carmichael"
        },
        {
            "review_text": "Battery lasts about 8 to 9 hours, which is pretty good I'll say. But, it takes about 2 hours and 15 minutes to charge completely. Super convenient for on the go use and good quality! I use it for writing.",
            "review_posted_date": "18 Jun 2019",
            "review_header": "On the go Use",
            "review_rating": "5.0 ",
            "review_author": "Erica Contreras"
        },
        {
            "review_text": "Product works like a champ. No damage and on time promised. Would absolutely buy from them again.",
            "review_posted_date": "11 Feb 2019",
            "review_header": "Delivery on time and product as expected.",
            "review_rating": "5.0 ",
            "review_author": "Dorice Tharp"
        },
        {
            "review_text": "Great product! Super fast, quality construction, any viewing angle, super portable.",
            "review_posted_date": "03 Apr 2019",
            "review_header": "Best 2 in 1",
            "review_rating": "5.0 ",
            "review_author": "Early Adopter"
        },
        {
            "review_text": "One of the best, SP6 fit for my work and lifestyle too....hope it stays in the roadmap of msft👌",
            "review_posted_date": "07 Jun 2019",
            "review_header": "....",
            "review_rating": "5.0 ",
            "review_author": "Grace"
        },
        {
            "review_text": "Una PC, del tamaño de una tablet. Agil. Rápida. Liviana. La utilizo para trabajar, cuando estoy fuera de casa. Falta el lanzamiento del cover con teclado en español.",
            "review_posted_date": "07 Feb 2019",
            "review_header": "Surface Pro 6",
            "review_rating": "5.0 ",
            "review_author": "Adriana"
        },
        {
            "review_text": "This my first-time Surface user. It is more than satisfied!",
            "review_posted_date": "31 Dec 2018",
            "review_header": "More than satisfied!",
            "review_rating": "5.0 ",
            "review_author": "Mazen"
        },
        {
            "review_text": "Left top corner where both pieces of bezel meet was pushed up. Either shipping or manufacturer defect. Returned got another one with perfect bezels.",
            "review_posted_date": "10 Mar 2019",
            "review_header": "Make sure you check the bezel for any imperfections.",
            "review_rating": "3.0 ",
            "review_author": "Monkey Escape goat"
        },
        {
            "review_text": "Came with Windows 10 Pro, so could activate Windows. Had a time getting that fixed but customer support got me there. Unit is great, fast, very portable and all the other things my friends said it would be. Refurbished Surface Pro 6, i7, 8/256gb, refurbished mouse, keyboard and dock. Ordered another set for wife. About $2600. I am Realtor, she owns small financial service company. Get Office 365 with it, store all in cloud, enjoy max flexibility. Power deal.",
            "review_posted_date": "11 Jul 2019",
            "review_header": "All that it's supposed to be",
            "review_rating": "5.0 ",
            "review_author": "Robert Chenery"
        },
        {
            "review_text": "Everything I wanted in a computer, with the ability to act like a tablet. Love it.",
            "review_posted_date": "01 Apr 2019",
            "review_header": "Great computer.",
            "review_rating": "5.0 ",
            "review_author": "Kat"
        },
        {
            "review_text": "I finally pulled the trigger and bought the surface pro 6 and I love it. I use it for class every day to take notes and as a computer. The 8th gen i5 is really fast and the display is beautiful.",
            "review_posted_date": "13 Feb 2019",
            "review_header": "I love it.",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Surface just hit my expectations. Everything i need in a tablet + PC is here. One problem though is the lower part where it touches the table etc, after weeks of using it, i think paint just chip off a little bit but its ok. And switching from pc to tablet mode its not as smooth as it is from other tablets. But overall its the best pc tablet.",
            "review_posted_date": "25 Feb 2019",
            "review_header": "The best PC Tablet for Architects",
            "review_rating": "5.0 ",
            "review_author": "Jose Ontanillas Jr"
        },
        {
            "review_text": "I am really enjoying this table. Good quality and easy to use.",
            "review_posted_date": "09 Apr 2019",
            "review_header": "Really great tablet",
            "review_rating": "5.0 ",
            "review_author": "Emily Katherine"
        },
        {
            "review_text": "If you are looking for a laptop tablet hybrid this is the one! You really won’t beat the quality. But if you are serious about one or the other it’s not quite enough. (Not good for gaming!)",
            "review_posted_date": "27 Apr 2019",
            "review_header": "Great laptop tablet hybrid",
            "review_rating": "4.0 ",
            "review_author": "Joshua"
        },
        {
            "review_text": "I love this laptop. Works well as a tablet. Kind of a PC in your hands. Works perfectly as a laptop. The pivoting back on the monitor isn't that good for actually having it on your lap. Something to finagle.",
            "review_posted_date": "21 Jun 2019",
            "review_header": "Fast fast fast",
            "review_rating": "5.0 ",
            "review_author": "Sonia"
        },
        {
            "review_text": "The new Microsoft Surface 6 is the perfect product for me. I use it for travel and for work at home. Everything we do uses Microsoft software so being able to use it both at work and at home or travel makes everything very easy for me.",
            "review_posted_date": "02 Jan 2019",
            "review_header": "Just As Advertised",
            "review_rating": "5.0 ",
            "review_author": "GRYBoston"
        },
        {
            "review_text": "surface pro has the qualities of laptop and tablet combined and is useful for work activities as well as hobbies.",
            "review_posted_date": "28 May 2019",
            "review_header": "would recommend",
            "review_rating": "5.0 ",
            "review_author": "John"
        },
        {
            "review_text": "i have received the keyboard missing a key I dont live in USA, and i could not find a Microsoft store neither in South America nor in Europe to the the missing key or to change the keyboard I am not returning to USA till november After two months of use, the keyboard have released form the screen, and the screen has broken even i have put a protection glass this is my experience with Surface",
            "review_posted_date": "25 May 2019",
            "review_header": "Hardware problems",
            "review_rating": "1.0 ",
            "review_author": "Edgard P."
        },
        {
            "review_text": "If you are here to decide whether to buy a surface or no, don't hesitate. i thru my laptop away and have been using this on the go all the time and inside my house. I use it for Autocad, Photoshop, Illustrator and as a media consumption device.",
            "review_posted_date": "05 Jul 2019",
            "review_header": "Such a great Product!",
            "review_rating": "5.0 ",
            "review_author": "Mallouk"
        },
        {
            "review_text": "Everything's great when it's Dell.",
            "review_posted_date": "12 Jan 2019",
            "review_header": "Great Computer!",
            "review_rating": "5.0 ",
            "review_author": "J Phillips"
        },
        {
            "review_text": "Love it",
            "review_posted_date": "20 Dec 2018",
            "review_header": "Great little, big computer",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "If you want to use this PC to connect to your company network, connect to another PC or encrypt your data you'll need to Upgrade the edition of Windows that ships pre-installed on this device from Home to Pro. Another $99 at the Microsoft Store or buy an upgrade product key somewhere if you can find it for less. They should call this model Surface Home 6.",
            "review_posted_date": "21 Jun 2019",
            "review_header": "Surface Pro, ships with Windows 10 Home",
            "review_rating": "4.0 ",
            "review_author": "K. Nerby"
        },
        {
            "review_text": "While it indicates that accessories are \"sold separately\" it still has them in the picture to look like they are part of the product.. Makes this price not competitive. Needs to be more up front about what you are getting and what you aren't.",
            "review_posted_date": "20 Feb 2019",
            "review_header": "Deceiving",
            "review_rating": "3.0 ",
            "review_author": "Paul Fisher"
        },
        {
            "review_text": "Awesome",
            "review_posted_date": "31 Jan 2019",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "Ray Ras"
        },
        {
            "review_text": "Great and strong device. High mobility. Very convenient for all purpose. It is elegant too and it has a very nice look.",
            "review_posted_date": "24 Feb 2019",
            "review_header": "Great device!",
            "review_rating": "5.0 ",
            "review_author": "Mam"
        },
        {
            "review_text": "Came as deacribed",
            "review_posted_date": "19 Dec 2018",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "Kinker"
        },
        {
            "review_text": "Love it!!",
            "review_posted_date": "10 Mar 2019",
            "review_header": "Small and comfortable, very fast and ligh weight",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Not a huge Microsoft fan but it works well and is compatible with so many other items.",
            "review_posted_date": "23 Apr 2019",
            "review_header": "Decent product for price",
            "review_rating": "5.0 ",
            "review_author": "Adrian V."
        },
        {
            "review_text": "Didn't realize how much I needed this until I actually started using it. It's my go-to for everything other than gaming. Extremely versatile and portable. If you're on the fence about getting one, don't be. Just do it!",
            "review_posted_date": "05 Jul 2019",
            "review_header": "Best Laptop/Tablet",
            "review_rating": "5.0 ",
            "review_author": "Renardo"
        },
        {
            "review_text": "look great, turn on no black screen still working, fast , game look great and this table have and any document I can just write on it for note",
            "review_posted_date": "07 Dec 2018",
            "review_header": "table",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Fantastic problem however the box of the actual computer was damaged just a tad. However I have no other complaints. I also do not mind the surface pro lap experience, it’s not as bad as people make it out to seem",
            "review_posted_date": "16 Jun 2019",
            "review_header": "Computer Box",
            "review_rating": "5.0 ",
            "review_author": "Owenreese"
        },
        {
            "review_text": "No complaints so far.",
            "review_posted_date": "07 Apr 2019",
            "review_header": "What I expected",
            "review_rating": "5.0 ",
            "review_author": "David Clark"
        },
        {
            "review_text": "Had to replace an old PC and this was my choice.",
            "review_posted_date": "22 Mar 2019",
            "review_header": "Love it!",
            "review_rating": "5.0 ",
            "review_author": "KENNETH J WALTERS"
        },
        {
            "review_text": "Battery life is not as advertised!! Shame on Microsoft",
            "review_posted_date": "17 Feb 2019",
            "review_header": "Battery life sucks",
            "review_rating": "1.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I bought this for school and its work amazingly. It tuns really smooth and is really fast. It can handle anything from simple browsing to processing a picture. This is perfect for school or work!",
            "review_posted_date": "09 May 2019",
            "review_header": "Perfect School Laptop",
            "review_rating": "5.0 ",
            "review_author": "Kimberly"
        },
        {
            "review_text": "I use it for my everyday light work (mainly with documents) and entertainment (videos, movies, etc). It is an excellent tool for the right person. It is light for carrying around and works fine for me.",
            "review_posted_date": "27 May 2019",
            "review_header": "Works fine for the right person",
            "review_rating": "5.0 ",
            "review_author": "Ani"
        },
        {
            "review_text": "The device came in good condition but power adapter is not Microsoft original accessory I buyed used but original....if is possible to get the original power adapter will be the correct and nice",
            "review_posted_date": "11 Mar 2019",
            "review_header": "No completely original",
            "review_rating": "3.0 ",
            "review_author": "Nelson T."
        },
        {
            "review_text": "It was not sell in Singapore as black color. That is why i used amazon and it was perfect. I ordered on 05 Apr and got on 08 Apr. It doesn't make sense. So fast! Everything is good",
            "review_posted_date": "15 Apr 2019",
            "review_header": "It doesn't make sense.",
            "review_rating": "5.0 ",
            "review_author": "Helen"
        },
        {
            "review_text": "In love with it",
            "review_posted_date": "19 Mar 2019",
            "review_header": "Love it",
            "review_rating": "5.0 ",
            "review_author": "Francis Troncoso"
        },
        {
            "review_text": "I’ve been using it for one and half month. In most cases it’s working well. But somehow today the frequency of CPU get stuck at 0.4 MHz and things going really really slow. I googled this issue and it seems that many people saw this issue and the reason is that some sensor of this laptop is not working well. I could bring bring the frequency of CPU back by disabling sensor but I still feel disappointed that how could such a new laptop have some problem like this.",
            "review_posted_date": "16 Jul 2019",
            "review_header": "Okay but frequency of CPU get stuck at 0.4 GHz after 1.5 month!",
            "review_rating": "3.0 ",
            "review_author": "Ling Yan"
        },
        {
            "review_text": "Bought this for my son for college. Probably overkill, but this is made extremely well and will be versatile for use in many ways when he goes away!",
            "review_posted_date": "12 Jul 2019",
            "review_header": "Beautiful Laptop/Tablet!",
            "review_rating": "5.0 ",
            "review_author": "WisconsinEh"
        },
        {
            "review_text": "No comment",
            "review_posted_date": "26 May 2019",
            "review_header": "Very good price",
            "review_rating": "5.0 ",
            "review_author": "Mohammed Al Augheer"
        },
        {
            "review_text": "tal lo esperado el equipo es muy bueno. El tiempo de entrega fue muchisimo antes d lo acordado.",
            "review_posted_date": "07 Apr 2019",
            "review_header": "increible equipo",
            "review_rating": "5.0 ",
            "review_author": "Jimmy Paul Luna victoria Becerra"
        },
        {
            "review_text": "Good",
            "review_posted_date": "11 Jun 2019",
            "review_header": "Nice",
            "review_rating": "5.0 ",
            "review_author": "P.M."
        },
        {
            "review_text": "Very good device , powerfull & light in weight.",
            "review_posted_date": "03 Jul 2019",
            "review_header": "Very good seller, I gave him full stars.",
            "review_rating": "5.0 ",
            "review_author": "Ahmed Elsaady"
        },
        {
            "review_text": "I have bought dozens of gen 4 and 5 Pro Surface's for my client's. All they came with Win 10 Pro. This one is not only more expensive then the previous models but it comes with Home edition OS which is useless for domain environment.",
            "review_posted_date": "25 Apr 2019",
            "review_header": "Pro is not a PRO but Home",
            "review_rating": "1.0 ",
            "review_author": "Lemonov"
        },
        {
            "review_text": "Its the best!",
            "review_posted_date": "06 Jul 2019",
            "review_header": "Cant beat the price with this vendor",
            "review_rating": "5.0 ",
            "review_author": "MD from SD"
        },
        {
            "review_text": "Resolución is really bad . I was expecting something better, and the surface get hot like hell you’ve not even able to touch it when watching video . Poor battery life . I’m only able to get 3 hours of video .",
            "review_posted_date": "30 Mar 2019",
            "review_header": "Bad choice",
            "review_rating": "3.0 ",
            "review_author": "Jorge Gonzalez"
        },
        {
            "review_text": "Great ! When you are satisfied with a product - there is not much to say. Well, thank you seller for great product and quality product .",
            "review_posted_date": "05 Apr 2019",
            "review_header": "Amazing",
            "review_rating": "5.0 ",
            "review_author": "Darya Rioux"
        },
        {
            "review_text": "I was so psyched that it had it's own version of the magnetic power cord that it could have burned my house down and given me tuberculosis and I'd still give it four stars. It's had to reboot a few times after problems and how to use some of the apps isn't totally intuitive but I've been happy with it otherwise.",
            "review_posted_date": "14 Jun 2019",
            "review_header": "Magnetic power cord baby!",
            "review_rating": "4.0 ",
            "review_author": "Robert F. Becht"
        },
        {
            "review_text": "This is a great 2 in 1 solution. The laptop is powerful enough to run my macros but still is sleek and feel like a tablet.",
            "review_posted_date": "14 Jul 2019",
            "review_header": "Very happy with my purchase!",
            "review_rating": "5.0 ",
            "review_author": "Paula K."
        },
        {
            "review_text": "Chose black one but received platinum one",
            "review_posted_date": "31 Jan 2019",
            "review_header": "Wrong color",
            "review_rating": "1.0 ",
            "review_author": "Daniel"
        },
        {
            "review_text": "Estacion de trabajo de alto desempeño",
            "review_posted_date": "06 May 2019",
            "review_header": "Excelente compra",
            "review_rating": "5.0 ",
            "review_author": "Cliente de Amazon"
        },
        {
            "review_text": "Awesome product!",
            "review_posted_date": "21 Dec 2018",
            "review_header": "Everything",
            "review_rating": "5.0 ",
            "review_author": "Donald B"
        },
        {
            "review_text": "Best computer I have ever used",
            "review_posted_date": "11 Jul 2019",
            "review_header": "Wow",
            "review_rating": "5.0 ",
            "review_author": "Charlie B"
        },
        {
            "review_text": "I like how powerful this 2-in-1 can be, like desktop PC, but at 1kg (with the keyboard attched) it is still quite heavy.",
            "review_posted_date": "14 Jun 2019",
            "review_header": "Powerful device but not perfectly handy",
            "review_rating": "5.0 ",
            "review_author": "Mark Anthony Dela Cruz"
        },
        {
            "review_text": "Good device.",
            "review_posted_date": "01 Jun 2019",
            "review_header": "Good device",
            "review_rating": "5.0 ",
            "review_author": "Binh Q Le"
        },
        {
            "review_text": "Been dreaming of having this for some time now.. Now that I have it, love using it. Make me very productive!",
            "review_posted_date": "05 Jun 2019",
            "review_header": "Tablet that can replace your laptop!",
            "review_rating": "5.0 ",
            "review_author": "Tij"
        },
        {
            "review_text": "Very responsive and smooth. I have zero patience for lag and this device is lag free.",
            "review_posted_date": "25 May 2019",
            "review_header": "Best Investment",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "like iPad, with power and ease of laptop!",
            "review_posted_date": "26 Dec 2018",
            "review_header": "Surface Terrific",
            "review_rating": "5.0 ",
            "review_author": "Michael C."
        },
        {
            "review_text": "Perfect for work at home and traveling.",
            "review_posted_date": "12 Jun 2019",
            "review_header": "Fast, reliable",
            "review_rating": "5.0 ",
            "review_author": "Steve Bramblett"
        },
        {
            "review_text": "This is an amazing machine. Great for digital art and design work.",
            "review_posted_date": "03 Jun 2019",
            "review_header": "Great purchase, very satisfied!",
            "review_rating": "5.0 ",
            "review_author": "Jony Patel"
        },
        {
            "review_text": "Amazing producr",
            "review_posted_date": "04 Jan 2019",
            "review_header": "Super fast shipping",
            "review_rating": "5.0 ",
            "review_author": "VSoto"
        },
        {
            "review_text": "For small business...nimble, powerful and sleek!",
            "review_posted_date": "10 Jul 2019",
            "review_header": "Great solution",
            "review_rating": "5.0 ",
            "review_author": "Nanotoo"
        },
        {
            "review_text": "Its small and easy to use. Love it!",
            "review_posted_date": "18 Mar 2019",
            "review_header": "Excellent computer",
            "review_rating": "5.0 ",
            "review_author": "Tracye Venable"
        },
        {
            "review_text": "durable package, well performance with QuadCore Processer and nice design.",
            "review_posted_date": "31 Dec 2018",
            "review_header": "good and good",
            "review_rating": "5.0 ",
            "review_author": "SWJ"
        },
        {
            "review_text": "Delivered as promised.",
            "review_posted_date": "03 Feb 2019",
            "review_header": "Delivered as promised",
            "review_rating": "5.0 ",
            "review_author": "JR"
        },
        {
            "review_text": "Product arrived not as described “no damage like new” , two scratch found and dents",
            "review_posted_date": "28 May 2019",
            "review_header": "Product arrived not as described",
            "review_rating": "2.0 ",
            "review_author": "JHvoon"
        },
        {
            "review_text": "Ok",
            "review_posted_date": "12 Apr 2019",
            "review_header": "$",
            "review_rating": "5.0 ",
            "review_author": "Ibrahim suliman alsayari"
        },
        {
            "review_text": "👌",
            "review_posted_date": "09 Mar 2019",
            "review_header": "👌",
            "review_rating": "5.0 ",
            "review_author": "T.O."
        },
        {
            "review_text": "Great little device. I wish the accessories we aren't as expensive. Keyboard and a mouse a must if you want to use it as an everyday device or laptop. Very good battery life too",
            "review_posted_date": "23 Jun 2019",
            "review_header": "Great device",
            "review_rating": "4.0 ",
            "review_author": "POLYDOROU C"
        },
        {
            "review_text": "Don’t buy it is the surface pro 4",
            "review_posted_date": "13 Jul 2019",
            "review_header": "Don’t buy",
            "review_rating": "1.0 ",
            "review_author": "jessica"
        },
        {
            "review_text": "love it！",
            "review_posted_date": "06 Feb 2019",
            "review_header": "nice",
            "review_rating": "5.0 ",
            "review_author": "Jiabao Ren"
        },
        {
            "review_text": "good",
            "review_posted_date": "14 Feb 2019",
            "review_header": "good",
            "review_rating": "5.0 ",
            "review_author": "Abeer"
        },
        {
            "review_text": "Great device. Can still improve on battery life",
            "review_posted_date": "29 Jun 2019",
            "review_header": "Best hybrid pc tablet in the market",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Works as advertised, great tablet so far.",
            "review_posted_date": "23 Jun 2019",
            "review_header": "Great tablet so far.",
            "review_rating": "5.0 ",
            "review_author": "John A. Sims"
        },
        {
            "review_text": "Really nice product overall.",
            "review_posted_date": "10 May 2019",
            "review_header": "Great product",
            "review_rating": "5.0 ",
            "review_author": "Mathias Monios"
        },
        {
            "review_text": "Love it!!! I’d give it a 6 if I could!!",
            "review_posted_date": "22 Jun 2019",
            "review_header": "Love it!!!",
            "review_rating": "5.0 ",
            "review_author": "Bruce Eddy"
        },
        {
            "review_text": "Good windows tablet",
            "review_posted_date": "30 Jun 2019",
            "review_header": "Good",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Stop selling the Surface Pros with WINDOWS HOME!!!!",
            "review_posted_date": "12 Jul 2019",
            "review_header": "WINDOWS HOME VERSION INSTALLED",
            "review_rating": "2.0 ",
            "review_author": "Clint Brinkley"
        },
        {
            "review_text": "The only problem that this equipment has is the battery life; you must charge it regularly.",
            "review_posted_date": "29 Jun 2019",
            "review_header": "Works great!!! But the battery...... not so good",
            "review_rating": "4.0 ",
            "review_author": "Juan Carlos Olivero"
        },
        {
            "review_text": "It is good",
            "review_posted_date": "27 May 2019",
            "review_header": "Online",
            "review_rating": "5.0 ",
            "review_author": "Rose"
        },
        {
            "review_text": "Is a really good product.",
            "review_posted_date": "14 Apr 2019",
            "review_header": "Ergonomic and fictional",
            "review_rating": "4.0 ",
            "review_author": "Carmelo"
        },
        {
            "review_text": "It's the same desktop but portable and fun to use",
            "review_posted_date": "10 Dec 2018",
            "review_header": "Great product when portability is important!",
            "review_rating": "5.0 ",
            "review_author": "Gagik Arustamyn"
        },
        {
            "review_text": "I like to be able to hand write notes using One Note and have them converted to text. Precision is good. HThe more you practice the better it gets.",
            "review_posted_date": "13 Jul 2019",
            "review_header": "Good for writting notes during back-to-back meetings",
            "review_rating": "5.0 ",
            "review_author": "Patricia Perlingeiro"
        },
        {
            "review_text": "Got it within a week, works great",
            "review_posted_date": "13 Mar 2019",
            "review_header": "Ships fast",
            "review_rating": "5.0 ",
            "review_author": "Rwantare David Titus"
        },
        {
            "review_text": "Fast shipping, super detailed tracking info, good product!",
            "review_posted_date": "04 Feb 2019",
            "review_header": "Price worthy",
            "review_rating": "5.0 ",
            "review_author": "Darien Rivera"
        },
        {
            "review_text": "This product has dual function as laptop and tablet. Looks simple.",
            "review_posted_date": "05 Jan 2019",
            "review_header": "Reliable vendor",
            "review_rating": "4.0 ",
            "review_author": "bmuliawan"
        },
        {
            "review_text": "great laptop. only drawback is that need to pay for additional accessories like pen and keyboard. and I haven't figured out how to turn off the screen brightness adjustment due to to the Intel graphics chip (adaptive brightness is turned off in windows).",
            "review_posted_date": "17 Jun 2019",
            "review_header": "meets expectation",
            "review_rating": "5.0 ",
            "review_author": "Eiran"
        },
        {
            "review_text": "Ordered platinum got flat black (no big deal) i7-8650, 512gb hd, 16gb ram. Windows pro not home (win) Microsoft store said within 45 days of purchase they would let me add the 2 year extended warranty for $140",
            "review_posted_date": "12 Jul 2019",
            "review_header": "Wrong color but perfect spec i7 surface pro 6 NEW!",
            "review_rating": "5.0 ",
            "review_author": "bikram kang"
        },
        {
            "review_text": "There is a before and after",
            "review_posted_date": "28 Apr 2019",
            "review_header": "Value for money",
            "review_rating": "5.0 ",
            "review_author": "BdC"
        },
        {
            "review_text": "Works great!",
            "review_posted_date": "19 Jan 2019",
            "review_header": "Works great!!",
            "review_rating": "5.0 ",
            "review_author": "martin elsant"
        },
        {
            "review_text": "I was thinking about returning back, but after a week using, I completely fell in love with it.",
            "review_posted_date": "15 Mar 2019",
            "review_header": "Read and fantastic",
            "review_rating": "5.0 ",
            "review_author": "Minrui Zhang"
        },
        {
            "review_text": "Love it, just wish I could remove Bing",
            "review_posted_date": "02 Jan 2019",
            "review_header": "Great product",
            "review_rating": "5.0 ",
            "review_author": "Stephanie"
        },
        {
            "review_text": "No Comment",
            "review_posted_date": "30 May 2019",
            "review_header": "No comment",
            "review_rating": "4.0 ",
            "review_author": "GWright"
        },
        {
            "review_text": "The device is good than what i expected. The delivery was more than i expected. Thanks alot.",
            "review_posted_date": "03 Jan 2019",
            "review_header": "Marvellous Tablet.",
            "review_rating": "5.0 ",
            "review_author": "Mohammad Abdulaziz Hajiah"
        },
        {
            "review_text": "I received an older model. Surface pro 5 Returned it. Waste of time I was expecting to work with it this weekend but it will be not possible",
            "review_posted_date": "29 Nov 2018",
            "review_header": "They Tried to give me a fake 6",
            "review_rating": "1.0 ",
            "review_author": "Kenny R"
        },
        {
            "review_text": "The Best purchase I have ever made at Amazon",
            "review_posted_date": "04 Apr 2019",
            "review_header": "Everything is perfect",
            "review_rating": "5.0 ",
            "review_author": "Abdelrahman"
        },
        {
            "review_text": "NICE",
            "review_posted_date": "24 Apr 2019",
            "review_header": "VERY SECURE",
            "review_rating": "5.0 ",
            "review_author": "David Wayne"
        },
        {
            "review_text": "Great features and usefulness.",
            "review_posted_date": "12 Jan 2019",
            "review_header": "Good value",
            "review_rating": "5.0 ",
            "review_author": "Stan Penwell"
        },
        {
            "review_text": "Love the surface pro well worth the money",
            "review_posted_date": "19 Dec 2018",
            "review_header": "Worth the cost",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "This is a great tablet!",
            "review_posted_date": "29 Mar 2019",
            "review_header": "Surface Pro 6",
            "review_rating": "5.0 ",
            "review_author": "Cathy"
        },
        {
            "review_text": "Great laptop. Does exactly what it says. Prefer it over the iPad Pro I was using.",
            "review_posted_date": "08 Apr 2019",
            "review_header": "Wonderful Laptop!!!",
            "review_rating": "5.0 ",
            "review_author": "David Frees"
        },
        {
            "review_text": "This tablet is a fast lightweight device and exactly what I need for mobility.",
            "review_posted_date": "02 Apr 2019",
            "review_header": "Fast and lightweight...",
            "review_rating": "5.0 ",
            "review_author": "AntMan"
        },
        {
            "review_text": "Use the machine for all things: i7 surface pro is just an excellent system for those that value versatile and efficient system",
            "review_posted_date": "18 Jun 2019",
            "review_header": "Powerful i7, portable, smooth touch, finger reader is second to none, face scanner is just too good",
            "review_rating": "5.0 ",
            "review_author": "Tops"
        },
        {
            "review_text": "Received the product on time (which was great). But there was a problem with the screen (some blue and tint on the screen). Returned the product for a replacement. Will wait for replacement then I will update review.",
            "review_posted_date": "16 Jul 2019",
            "review_header": "Problem with the screen",
            "review_rating": "2.0 ",
            "review_author": "Mestipen M. Cheng"
        },
        {
            "review_text": "This a replacement for my children's older Surface as it stopped charging even after endless hacking. So do expect charging issues in the future.",
            "review_posted_date": "14 Jul 2019",
            "review_header": "Form factor is almost perfect.",
            "review_rating": "5.0 ",
            "review_author": "tang kwok hwa"
        },
        {
            "review_text": "I am very happy with My Microsoft Surface Pro 6 and i would do future business with you in the near futures.",
            "review_posted_date": "15 Mar 2019",
            "review_header": "this is Great produst",
            "review_rating": "5.0 ",
            "review_author": "George Mendoza"
        },
        {
            "review_text": "Grandson says it's a good one.",
            "review_posted_date": "19 Jun 2019",
            "review_header": "Purchased as a graduation gift.",
            "review_rating": "5.0 ",
            "review_author": "john"
        },
        {
            "review_text": "Best tablet ever..only thing is my charger is not working properly. It does not get hot or warm. i can add more storage if necessary. Get it with the pen and keyboard to experience the full features.",
            "review_posted_date": "17 Jul 2019",
            "review_header": "Great windows tablet/ laptop",
            "review_rating": "5.0 ",
            "review_author": "Janae Fisher"
        },
        {
            "review_text": "The product is very good",
            "review_posted_date": "18 Apr 2019",
            "review_header": "Excellent",
            "review_rating": "5.0 ",
            "review_author": "sokro19"
        },
        {
            "review_text": "Excelent, on time",
            "review_posted_date": "15 Nov 2018",
            "review_header": "Five Star",
            "review_rating": "5.0 ",
            "review_author": "AJ"
        },
        {
            "review_text": "and it is working fine.",
            "review_posted_date": "26 Apr 2019",
            "review_header": "Good product",
            "review_rating": "5.0 ",
            "review_author": "Danny"
        },
        {
            "review_text": "Surface Pro is the to go choice when it comes to school work for college students.",
            "review_posted_date": "11 Apr 2019",
            "review_header": "Perfect for school work",
            "review_rating": "5.0 ",
            "review_author": "Bradley Ye"
        },
        {
            "review_text": "That only the computer came and not the stylus or keyboard...",
            "review_posted_date": "27 Feb 2019",
            "review_header": "Misleading...",
            "review_rating": "3.0 ",
            "review_author": "evan"
        },
        {
            "review_text": "Great device",
            "review_posted_date": "10 Apr 2019",
            "review_header": "Good",
            "review_rating": "5.0 ",
            "review_author": "Ahmad"
        },
        {
            "review_text": "This was very misleading. Only came with surface and charger.",
            "review_posted_date": "16 May 2019",
            "review_header": "Misleading-doesnt come with any extras",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Was a Christmas gift and they LOVE it",
            "review_posted_date": "25 Jan 2019",
            "review_header": "Great value and great product",
            "review_rating": "5.0 ",
            "review_author": "Linda"
        },
        {
            "review_text": "it's got an amazing, crisp screen and it's super fast while being super light and lasting the whole day on one charge. THe best part is that it's running a full version of Windows.",
            "review_posted_date": "31 Mar 2019",
            "review_header": "Perfect Laptop",
            "review_rating": "5.0 ",
            "review_author": "Kindle Customer"
        },
        {
            "review_text": "Excellent stuff",
            "review_posted_date": "30 Nov 2018",
            "review_header": "Masterpiece",
            "review_rating": "5.0 ",
            "review_author": "BJ"
        },
        {
            "review_text": "I never ordered this product. Somehow an order in my name got placed. Cancelled it",
            "review_posted_date": "13 May 2019",
            "review_header": "Be very very careful checking prices or you may end up ordering something you do not want.",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Slight lag which is a bit disappointing especially for a new device.. But more or less very fast.. Let's hope this continues in the long run",
            "review_posted_date": "04 Jun 2019",
            "review_header": "Looks good",
            "review_rating": "4.0 ",
            "review_author": "Ayush Mohan Makkar"
        },
        {
            "review_text": "Excellent for medium business",
            "review_posted_date": "18 Apr 2019",
            "review_header": "Perfect",
            "review_rating": "5.0 ",
            "review_author": "Mohamed Shedid"
        },
        {
            "review_text": "Excellent graphics and very good portability. Upgraded to Pro and attached to our domain. The pen works very nicely. Purchased the keyboard case and very satisfied with that s well.",
            "review_posted_date": "09 Jan 2019",
            "review_header": "Excellent product and very fast",
            "review_rating": "5.0 ",
            "review_author": "JB"
        },
        {
            "review_text": "Just what I needed based on who I am.",
            "review_posted_date": "16 Apr 2019",
            "review_header": "Best decision I made for the quarter",
            "review_rating": "5.0 ",
            "review_author": "kerreece arjoon"
        },
        {
            "review_text": "I changed my surface pro 4 for this one after using it for almost 3 years... I didnt notice so much the improvement, but it is an excelent equipment.",
            "review_posted_date": "24 May 2019",
            "review_header": "Excelente laptop!",
            "review_rating": "5.0 ",
            "review_author": "Carlos Huertas"
        },
        {
            "review_text": "This is an upgrade from my surface pro 2. I absolutely love this device for all my work related tasks. If you need to be productive behind the desk or on the go, this is the way to go!",
            "review_posted_date": "28 Dec 2018",
            "review_header": "Perfect for work on the go",
            "review_rating": "5.0 ",
            "review_author": "Jen Q"
        },
        {
            "review_text": "I am using my Pro 6 for work at home to keep from taking laptop back and forth which means not plugging and unplugging my work computer.",
            "review_posted_date": "07 Jan 2019",
            "review_header": "Convenience",
            "review_rating": "5.0 ",
            "review_author": "Lucia M. Cunningham"
        },
        {
            "review_text": "I love it",
            "review_posted_date": "29 Jun 2019",
            "review_header": "Great device",
            "review_rating": "5.0 ",
            "review_author": "Kawthar J."
        },
        {
            "review_text": "Woohoo",
            "review_posted_date": "23 Mar 2019",
            "review_header": "Great",
            "review_rating": "5.0 ",
            "review_author": "Beckett C."
        },
        {
            "review_text": "Fantastic. As expected. Thanks a lot.",
            "review_posted_date": "03 Feb 2019",
            "review_header": "Marvellous",
            "review_rating": "5.0 ",
            "review_author": "KSA"
        },
        {
            "review_text": "Everything is going",
            "review_posted_date": "05 Feb 2019",
            "review_header": "Excellant!!",
            "review_rating": "5.0 ",
            "review_author": "hamed"
        },
        {
            "review_text": "Not having a fan can become a factor with heavier use , but overall if you’re only using it as a student you should be good. The tablet display is weird tho.",
            "review_posted_date": "10 Jul 2019",
            "review_header": "Good for students",
            "review_rating": "3.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "great",
            "review_posted_date": "28 Feb 2019",
            "review_header": "good",
            "review_rating": "5.0 ",
            "review_author": "John Torbenson"
        },
        {
            "review_text": "Received product with damage screen.",
            "review_posted_date": "06 Mar 2019",
            "review_header": "Damage screen",
            "review_rating": "1.0 ",
            "review_author": "Hussain AlSaffar"
        },
        {
            "review_text": "Excellent product and seller",
            "review_posted_date": "15 Apr 2019",
            "review_header": "It is the best tablet in the world",
            "review_rating": "5.0 ",
            "review_author": "Eng.Suhail"
        },
        {
            "review_text": "Unlike the previous version of Surface series, Pro 6 is quite stable with fewer conflicts while converting in between PC and tablet mode.",
            "review_posted_date": "31 Mar 2019",
            "review_header": "Completeness",
            "review_rating": "5.0 ",
            "review_author": "SM Cho"
        },
        {
            "review_text": "Love it!",
            "review_posted_date": "29 Mar 2019",
            "review_header": "Love it!",
            "review_rating": "5.0 ",
            "review_author": "Adesi"
        },
        {
            "review_text": "Excellent little system. I get looks of admiration when I open this in public. It’s small, fast, sturdy and efficient.",
            "review_posted_date": "06 Mar 2019",
            "review_header": "Highly Recommend",
            "review_rating": "5.0 ",
            "review_author": "RBsiebert"
        },
        {
            "review_text": "the description was clear",
            "review_posted_date": "04 Apr 2019",
            "review_header": "Very good deal",
            "review_rating": "5.0 ",
            "review_author": "Abdulaziz Al-Dakhil"
        },
        {
            "review_text": "Everything according to expectation",
            "review_posted_date": "28 Dec 2018",
            "review_header": "Very surprised with performance..very good",
            "review_rating": "5.0 ",
            "review_author": "Evandro Maggio"
        },
        {
            "review_text": "El color negro de la surface simplemente es hermoso",
            "review_posted_date": "30 Jun 2019",
            "review_header": "Todo negro",
            "review_rating": "5.0 ",
            "review_author": "Norberth Anibal Mixan Mas"
        },
        {
            "review_text": "Good for light duty",
            "review_posted_date": "04 Feb 2019",
            "review_header": "Worth it 👍🏻",
            "review_rating": "4.0 ",
            "review_author": "Ahmed Altuwaijry"
        },
        {
            "review_text": "shipped out fast",
            "review_posted_date": "08 Dec 2018",
            "review_header": "Great laptop",
            "review_rating": "5.0 ",
            "review_author": "Philip M."
        },
        {
            "review_text": "Dead laotop out of Box... Black screen of death as described on many internet sites. Returning it for my money back!",
            "review_posted_date": "08 Jun 2019",
            "review_header": "Computer Dead out of Box",
            "review_rating": "1.0 ",
            "review_author": "Lori Bojason2jren"
        },
        {
            "review_text": "Total crap computer. Blue screen of death every twenty minutes. Trying to see if I can fix it, but really can’t recommend at this point.",
            "review_posted_date": "17 Jul 2019",
            "review_header": "Crashes Constantly",
            "review_rating": "1.0 ",
            "review_author": "Timothy R Havens"
        },
        {
            "review_text": "Very nice computer",
            "review_posted_date": "14 Jan 2019",
            "review_header": "Happy with it",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Good stuff",
            "review_posted_date": "27 Nov 2018",
            "review_header": "Good stuff",
            "review_rating": "5.0 ",
            "review_author": "Orujekwe Chibuzor"
        },
        {
            "review_text": "Great system.",
            "review_posted_date": "05 Mar 2019",
            "review_header": "Arrived and worked as it should.",
            "review_rating": "5.0 ",
            "review_author": "Cayman Technologies, Inc."
        },
        {
            "review_text": "The product arrive late and it didn’t work well as some of the keyboard letters did not work.",
            "review_posted_date": "06 Jun 2019",
            "review_header": "Seller must state correctly delivery date not after purchase then you get true date of arrival",
            "review_rating": "1.0 ",
            "review_author": "Luke N."
        },
        {
            "review_text": "Nothing is perfect: Lack of ports, easy scratching body. Otherwise perfect device.",
            "review_posted_date": "10 Jan 2019",
            "review_header": "Know your needs",
            "review_rating": "5.0 ",
            "review_author": "Eyvaz Eyvazov"
        },
        {
            "review_text": "Perfect for my home and office needs!",
            "review_posted_date": "01 Jan 2019",
            "review_header": "Good work and home",
            "review_rating": "5.0 ",
            "review_author": "Margaret A. Witt"
        },
        {
            "review_text": "Very good",
            "review_posted_date": "28 Feb 2019",
            "review_header": "Portable",
            "review_rating": "5.0 ",
            "review_author": "Juan C. Feliciano"
        },
        {
            "review_text": "Good device it just gives a blue screen almost every 2 hours.",
            "review_posted_date": "14 Apr 2019",
            "review_header": "good device",
            "review_rating": "2.0 ",
            "review_author": "Rudie Dreyer"
        },
        {
            "review_text": "Me encanto!",
            "review_posted_date": "14 Jul 2019",
            "review_header": "Excelente",
            "review_rating": "5.0 ",
            "review_author": "Juanita Franky"
        },
        {
            "review_text": "I like device. I dislike the shipping company.",
            "review_posted_date": "09 Jul 2019",
            "review_header": "It's a good device.",
            "review_rating": "4.0 ",
            "review_author": "AAZ"
        },
        {
            "review_text": "Great product and easy to set up.",
            "review_posted_date": "04 Mar 2019",
            "review_header": "Purchase this item if serious about a mobile work station.",
            "review_rating": "5.0 ",
            "review_author": "Payson FM Group"
        },
        {
            "review_text": "ok",
            "review_posted_date": "20 Jun 2019",
            "review_header": "Ok",
            "review_rating": "5.0 ",
            "review_author": "Leandro"
        },
        {
            "review_text": "I recently purchased a Surface Pro 6 from Costco and was pleasantly surprised. Microsoft with the Windows monopoly has rarely put out a competitive device in the last decades. The Surface series is the exception, it combines the familiar most commonly used Windows and Apple's ingenious user friendly tablet interface. Complete my work on Word, Excel, Photoshop, detach the keyboard, sit back relax and be entertained on the couch, play games, watch video with a touch of a gesture. It is by no means seamless but close to perfection with each new release. It isn't a dedicated machine to do one job better but many regular jobs we enjoy. Each innovation is getting a step ahead of Apple, my ipad now sits in the closet. We will start with the keyboard, it is magnetically linked, no battery to charge and has a tactile feedback of a full size keyboard. The back stand easily adjust to many angles, making watching movie, typing documents, browsing the net on bed, on the floor, on the couch, on my desk, even sitting on the toilet bowl as comfortable as it can get. No it does not have a USB-C port nor a Firewire port for heavy gamer but there are a ton of accessories you can buy to meet the mass users. Microsoft does not gouge you for money like Apple and the extra microSD port they provided is proof. I added 400Gb of storage with a $78 purchase https://www.amazon.com/gp/product/B074RNRM2B/ref=ppx_yo_dt_b_asin_title_o03__o00_s00?ie=UTF8&psc=1 I interfaced it with my TV with a $7 HDMI adapter https://www.amazon.com/gp/product/B07GYMM3L5/ref=ppx_yo_dt_b_asin_title_o05__o00_s00?ie=UTF8&psc=1 It is by far the lightest laptop I have ever had for traveling, watched 3 movies downloaded from Netflix before the trip before it ever needs a charge. The screen is super bright, easy to see for my old eyes and the speakers are louder than my 15\" gaming laptop. Simply amazing, my impress of Microsoft has changed since.",
            "review_posted_date": "15 Feb 2019",
            "review_header": "An exceptional accomplishment combining Windows and Apple's tablet type of interface",
            "review_rating": "5.0 ",
            "review_author": "Painter of Stories"
        },
        {
            "review_text": "This is my first positive review on Amazon. I wanted to get something new because I was over my 2016 Macbook. Keyboard kept messing up and it kept crashing when I would use Logic Pro. I purchased this one on Ebay since the i7 16gb was to expensive on Amazon. The keyboard is great. Trackpad is solid too but sometimes if your finger is in the middle it can't read exactly what you want to do. Screen is great. Battery life is okay but I have it running on full capacity and not battery save mode. Will update the review once I started editing videos and using Ableton.",
            "review_posted_date": "12 Dec 2018",
            "review_header": "Solid so far. Happy with my purchase",
            "review_rating": "5.0 ",
            "review_author": "Chris"
        },
        {
            "review_text": "Bought two bundles for my tween daughters who love to draw (did the 'big box store' $800 black Friday bundle which also included the pen). The Surface Pro line has always had great inking capabilities and this version 6 is no different (they prefer drawing onscreen vs. a dedicated WACOM pad from last Christmas, heh). That was also the best deal price wise for an i5 8GB/128GB keyboard + pen device around on this generation so far. Opted for these over the Surface Go which was an option because of the increased power of the processor (finally 8th gen i5 but not Whiskey Lake), the full keyboard size (Surface Go difficult to touch type on with cramped keyboard), and the screen size for drawing on, and the bundle worked out to only $100 more for the i5. Upon opening it up on Christmas and setting it up, the screen is really gorgeous in its vivid nicely saturated colors, and the CPU is nice and quick. I threw a couple of Samsung 128GB micro SD cards in for their local OneDrive mirrored storage for good measure. They're drawing up a storm and loving it. The Surface line were 2:1 genre definers and this is the latest and greatest, highly recommended!",
            "review_posted_date": "25 Dec 2018",
            "review_header": "Excellent for my budding artist daughters!",
            "review_rating": "5.0 ",
            "review_author": "John IV"
        },
        {
            "review_text": "I didn't buy one of these from Amazon or anywhere else but I use it every day at work as my main computer. This PC has been by far the buggiest, glitchiest, downright unreliable hunk of junk I have ever experienced from Microsoft. I have had problems with the surface bluetooth mouse not working, bluetooth stopping working altogether, constant driver problems, glitches when going from tablet to pc mode, touchpad stops working randomly, random crashes, dual display problems, USB not working on the dock, programs freezing and crashing (including Microsoft Office Suite programs), problems with updates. I can't wait to get rid of this thing.",
            "review_posted_date": "16 Mar 2019",
            "review_header": "Biggest Piece of Garbage PC I've Ever Used",
            "review_rating": "1.0 ",
            "review_author": "Squirrel"
        },
        {
            "review_text": "Microsoft Surface Pro 6 - I bought mine, yesterday. I already hate it, despite its rave reviews. The shortcoming with every 2-in-1 laptop/tablet, including this one, is the inherent compromise in trying to be all things to all people. If you need a laptop, then buy a laptop. If you need a tablet, then buy a tablet. If you need both, then buy both. But don't think that owning a 2-in-1 is an adequate substitute for either or both. I have 30 days to get a refund. So, I will keep it in new condition. I don't regret buying it, however, because there is no way to know what you need in the way of computer equipment, other than to buy it and try it. It is all part of the learning experience that cannot be achieved, just from reading buyer reviews without trying it.",
            "review_posted_date": "24 Feb 2019",
            "review_header": "2-in-1 laptop/tablets are an unsatisfactory compromise in their attempt to be both.",
            "review_rating": "3.0 ",
            "review_author": "Apoiuwerhpga"
        },
        {
            "review_text": "At the risk of sounding cliché, my surface pro 6 has changed the way I use my laptop/tablet and Windows 10. I absolutely love it and am constantly surprised at just how powerful it is. I have the i5 8GB model and never leave home without it. Everything about it is top-notch. The display is bright and beautiful. The battery life is amazing. It’s speedy and powerful enough to run SQL Server developer’s edition and Visual Studio without a hitch and even some Virtual Box server images for application development. I do not use my laptop or tablet anymore. They’ve both been replaced by my Surface Pro. I read on it, write applications on it, watch videos on it, and even do a little lite gaming on it. Nothing that needs a Geforce Card or anything, but plenty of great modern games run just fine on this beast. I got it on sale for black Friday, bundled with the keyboard case and I can honestly say, it’s been the best money I’ve spent on a device in a long time. My only complaint is with weird aspect ratio of the screen. It produces black bars or slight stretching with some games and videos that don’t allow custom resolutions. Still worth every penny. Simply amazing.",
            "review_posted_date": "16 Jan 2019",
            "review_header": "Simply Amazing",
            "review_rating": "5.0 ",
            "review_author": "ChrisM"
        },
        {
            "review_text": "Used corporate and personal laptops the past 9 years and nothing compares to the Surface Pros. Not even my friend’s Alienware or my wife’s MacBook can compare. I bought the new Surface Pro 6 and gave my Surface Pro to my wife who stopped using her MacBook.",
            "review_posted_date": "18 Dec 2018",
            "review_header": "Best laptop ever and it’s almost perfect.",
            "review_rating": "5.0 ",
            "review_author": "Nostromo"
        },
        {
            "review_text": "(not verified because I bought it directly from microsoft with the student discount) The surface pro is excellent in most regards design, screen quality, speed, battery, etc... but it sucks as a tablet. It's probably one of if not the best tablet on the market when it comes to being able to replace your laptop. I purchased the base i5 + 8gb specs (with the upgraded 256gb ssd), and it runs everyday stuff quite well. Absolutely no qualms with the performance. Maybe it's because I came from a 3+ year old laptop, but the screen was absolutely mind blowing when I first started using it. It's obviously a pretty high-res device, but the color is also super on point. I literally admire the screen just browsing normal websites with boring UIs lol. The battery was a bit disappoint at first, but after playing with the brightness/performance mode I was able to get a ton out of it. The 13.5 hour battery claim is probably a pretty significant exaggeration, but it's quite solid with the right settings. Everything about the pro 6 is high performance. The design is super freakin sleek, the black model looks awesome. It really hits the laptop side of the 2in1 concept. However... Windows 10 tablet mode is just so buggy that it really kills tablet use for me. I've owned my surface for 3 days, and tablet mode has already made me want to stop using it as a tablet altogether. More often than not, when I click on a text field (like google search) in chrome, the on-screen keyboard won't pop up, and I'll have to manually click the tiny keyboard button on the taskbar. Having to do this literally hundreds of times through an internet session is much more obnoxious than it sounds. Other tablet-mode bugs: -When trying to use windows 10 search at one point, the onscreen keyboard would only show up as invisible (basically just the border of the keyboard). -Every link I would click would open in a new tab. Took a bit of troubleshooting to realize that microsoft thought the control key was being held down (I definitely hadn't clicked it, and the keyboard was closed, anyway). I had to open up the onscreen keyboard, turn control on, then turn it off to fix it. -When opening up a second window in chrome, windows will randomly spaz out and switch between the two windows rapidly for a good 5-10 seconds. Bizarre. These are the bugs I encountered in just the first 3 days. I can't stress enough how annoying it is for the keyboard to not consistently popup when I click on a textfield in tablet mode. None of these bugs make the device unusable as a tablet, but they make the tablet experience frustrating. Considering the price tag of the pro 6 (plus the type cover, plus the pen), a product the costly shouldn't have such deficiencies. Unless you're really determined to have a 2-in-1, I'd grab some kind of touch screen laptop with similar specs and save a few hundred bucks. edit: took off a star cuz the battery is garbage, barely working after ~2 weeks",
            "review_posted_date": "16 Jan 2019",
            "review_header": "great as a laptop, fails as a tablet",
            "review_rating": "2.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "It's a decent touch screen laptop/tablet while it works. My Surface Pro 5 was dead after 17 months. Warranty was only for a year. Dropped it at the local Microsoft store and was told it's a hardware issue. They refused to tell me what hardware issue it was. Instead the technician was eager to sell me a refurbished replacement for $450. LOL. Yes $1100 only gave me 17 months of use. The cheapest Dell or HP can last more than 17 months. If you search on the web, you can find the reliability of the Surface line is at the bottom of the major brands. A very expensive lesson I learned but Microsoft you won't see me again.",
            "review_posted_date": "13 Jul 2019",
            "review_header": "Terrible reliability",
            "review_rating": "1.0 ",
            "review_author": "RainAndSun"
        },
        {
            "review_text": "I walked into the store a couple weeks ago and tried every 2-in-1 they had available. I found that Asus and Lenovo had some decent offerings, but I wasn’t truly impressed until I got to the Surface Pro 6. The first thing I noticed was the display. Gorgeous. I knew I had to have it as soon as I held it in portrait mode. I was absolutely sold. After a couple weeks, I’m happy to say that I’ve made the right purchase. I love the versatility and overall functionality of this thing. I can use it as a tablet on my lap, set up the kickstand and watch a movie (on a beautiful 1824p display), or snap on the keyboard and get some work done. The keyboard has a nice clicky feel to it, way better than your average laptop keyboard. The pen is a MUST BUY in my opinion, even if you don’t do much drawing. It’s just part of the Surface experience. Touch screen is super responsive with very little latency and palm rejection works fairly well. I’m really impressed with the performance on my i5 model. I wouldn’t say this thing is a powerhouse by any means (I ran the benchmarks... they were disappointing compared to my desktop build) but the 8th gen quad core i5 is a wonderful thing, and so far I haven’t had any issues with lag or slow performance. Everything has been ultra snappy. In fact, I’m impressed with how much is delivered in such a thin form factor (and fan-less design). I wouldn’t try to do any modern gaming or heavy video editing, but I have tested a series of multimedia production apps (Adobe CC, Davinci Resolve, Ableton Live) and found that they all worked wonderfully. I haven’t been able to test the battery much, but it definitely holds a decent charge. I went out and did some studying the other day, and was still at a 70% after about three hours of continuous use. Definitely one of the best features of the SP6. Overall, the Surface Pro 6 is an absolute treat. I’ve built numerous PCs over the years with much better hardware, but I can’t deny the versatility and stunning build quality of the Surface Pro. To me it is probably the best PC I’ve ever used. The only device that can rival the Surface Pro 6’s aesthetic and functionality is Lenovo’s X1 tablet (which is another solid choice, slightly more expensive). If you like using Windows 10 and the Surface Pro 6 is in your budget... it’s a no brainer.",
            "review_posted_date": "06 Mar 2019",
            "review_header": "Surface Pro 6 is the one!",
            "review_rating": "5.0 ",
            "review_author": "Amin Ardehali"
        },
        {
            "review_text": "Purchased this after sending back a Dell Inspiron 13 convertible laptop while the dell was slightly more powerful t wasn't half as premium and nice as the surface is. Also the dell seemed to get super hot even while just word processing. The surface is worth every penny and doesn't seem to get hot at all Processor is quick enough to run multiple programs quickly and not slow down much Memory is sufficient Graphics card is good enough for hidden object games and games on low settings Wifi speed supports newest standards and data transfer is quick Boot time is quick about 7 seconds Battery life lasts about 6-7 hours at 50% brightness Screen is very bright and clear Speakers and loud full and clean sounding Purchased the keyboard case with fingerprint sensor and it works perfectly as well seems almost like a full laptop. I would recommend this tablet to anyone looking for a full os on a tablet.",
            "review_posted_date": "11 May 2019",
            "review_header": "Very awesome laptop substitute",
            "review_rating": "5.0 ",
            "review_author": "Nathanb"
        },
        {
            "review_text": "Before I say anything I have to mention that I love the design of this, and I wish that it worked for me. I used the Surface Pro 6 for graphic design, and it is basically unusable for what I do. The problem, I found out, is the ambient cooling method instead of using fans. I do use some power hungry art software, but I didn't think it would have this much trouble. After about 30-40 minuets it would do a blue screen reboot to protect the hardware every time I used an art program. It never had any issue if I wasn't using those programs, and I could use it as long as I wanted. It is unfortunate because it has such an amazing pen and a great screen. I just love using it for the time it allowed me. Come to find out, you have to upgrade to the i7 in order to get the fans included in the system, and I would still be cautious of overheating after my experience. I hope that the next release have less of an issue with this, because I am still interested in being a Surface Pro owner.",
            "review_posted_date": "30 May 2019",
            "review_header": "Overheating Issues",
            "review_rating": "2.0 ",
            "review_author": "S Boy P"
        },
        {
            "review_text": "The Surface is an awesome laptop but just ok as a tablet. As a laptop: great specs. It’s light and fast, can handle any daily task easily and is very portable. I’ve seen some people complain that it’s difficult to use it on the lap but I had no trouble at all. Battery life is not as great as promised but it can get you through the day with medium use. As a tablet: Windows 10 is a desktop OS not a mobile one and that’s what disappointed me. It’s not Surface fault per say but there’s no way around this yet. The tablet mode is not enough. It lacks a lot of gestures to facilitate navigation. Another example: if you try to play Fortnite, the game will consider that you are a desktop player and won’t let you use the mobile configuration.",
            "review_posted_date": "14 Mar 2019",
            "review_header": "Know what you’re buying",
            "review_rating": "4.0 ",
            "review_author": "Fabio M. M. Cunha"
        },
        {
            "review_text": "Do not waste your money with any type of surface pro. If you are looking to buy a tablet computer for art or animation do not buy this computer. I would suggest buying a Fujitsu life book. I bought mine used off or eBay for $200 and it works way way better than any surface I have ever owned. The surface is bent on breaking and it is designed to keep you constantly buying new pen nibs or new version of the computer. Worst computer purchase ever.",
            "review_posted_date": "21 Feb 2019",
            "review_header": "Don’t waste your money here.",
            "review_rating": "2.0 ",
            "review_author": "Meghan"
        },
        {
            "review_text": "So I am a tax professional and had to upgrade my computer this year since my old one was over 4 years old. The surface pro 6 has exceeded all expectations and does everything I need it to do. Highly recommend to everyone!!",
            "review_posted_date": "15 Feb 2019",
            "review_header": "I LOVE my surface pro 6!!",
            "review_rating": "5.0 ",
            "review_author": "Joshua Jones"
        },
        {
            "review_text": "Pros : Functions well and has many uses for digital art and design Cons : Deteriorates within several months of use, functions such as screen input recognition and performance degrades to the point of being unusable. Surface products seem to be built for last until the next concept can be drawn. Avoid if you plan to use it for more than a period of 6 months.",
            "review_posted_date": "04 Mar 2019",
            "review_header": "Deteriorates as quickly as other surface products",
            "review_rating": "2.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "I love this surface! I can use it for days without it being charged. It is functional for my spreadsheets, webinars, and my kids playing games or watching movies. It syncs easily with whatever I have going on. I love my surface.",
            "review_posted_date": "13 Apr 2019",
            "review_header": "Best investment ever!!!!!!!",
            "review_rating": "5.0 ",
            "review_author": "Q. Gipson"
        },
        {
            "review_text": "Battery only lasted a month and now won't charge at all. Weird blueish discoloration occurred on a portion of the screen. Mainly use it at home, but it lost it's value to me since the battery won't charge and it's tethered to an outlet at all times. Should have bought this from an actual storefront.",
            "review_posted_date": "07 Mar 2019",
            "review_header": "Bad battery, bad picture",
            "review_rating": "1.0 ",
            "review_author": "James Fenton"
        },
        {
            "review_text": "Way way over priced. Only Baught cause a loved one wanted but would never buy again too pricey.",
            "review_posted_date": "26 Dec 2018",
            "review_header": "Price And Quality And Packaging",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Wish I had the 2,200 dollars buy this ☹",
            "review_posted_date": "01 Jan 2019",
            "review_header": "So expensive",
            "review_rating": "1.0 ",
            "review_author": "Da Ba dee"
        },
        {
            "review_text": "Nice product",
            "review_posted_date": "28 Jan 2019",
            "review_header": "Great battery life and easy to carry around",
            "review_rating": "4.0 ",
            "review_author": "Arshad Shaik"
        },
        {
            "review_text": "Good",
            "review_posted_date": "13 Jun 2019",
            "review_header": "Fiability",
            "review_rating": "5.0 ",
            "review_author": "AIRONE"
        },
        {
            "review_text": "Nice",
            "review_posted_date": "24 Mar 2019",
            "review_header": "Good",
            "review_rating": "5.0 ",
            "review_author": "tika"
        },
        {
            "review_text": "Perfect for what i needed",
            "review_posted_date": "13 Jul 2019",
            "review_header": "Thank you Microsoft",
            "review_rating": "5.0 ",
            "review_author": "Michelle L. Bozeman"
        },
        {
            "review_text": "Everything is excellent",
            "review_posted_date": "03 Feb 2019",
            "review_header": "Good seller good product",
            "review_rating": "5.0 ",
            "review_author": "montasser ahmed alfol"
        },
        {
            "review_text": "Thnks,",
            "review_posted_date": "27 Jan 2019",
            "review_header": "Thnksss",
            "review_rating": "5.0 ",
            "review_author": "Ender ALTIN"
        },
        {
            "review_text": "Not as fast ad published. Some problems when displaying some app.",
            "review_posted_date": "27 Feb 2019",
            "review_header": "Overated",
            "review_rating": "3.0 ",
            "review_author": "jorgeD"
        },
        {
            "review_text": "Fast tablet but ports are outdated.",
            "review_posted_date": "16 Apr 2019",
            "review_header": "Can be a desktop PC replacement",
            "review_rating": "4.0 ",
            "review_author": "JAA1960"
        },
        {
            "review_text": "the quality of the screen is amazing but even if you put it at low performance the battery doesn't stay long as expected.",
            "review_posted_date": "25 Jun 2019",
            "review_header": "battery life is good but not amazing",
            "review_rating": "5.0 ",
            "review_author": "faris"
        },
        {
            "review_text": "de lo mejor.",
            "review_posted_date": "12 Jul 2019",
            "review_header": "Compatible",
            "review_rating": "5.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "Love it!",
            "review_posted_date": "16 Jul 2019",
            "review_header": "Awesome little machine",
            "review_rating": "5.0 ",
            "review_author": "MariaP"
        },
        {
            "review_text": "Not working",
            "review_posted_date": "12 Jul 2019",
            "review_header": "Not working",
            "review_rating": "1.0 ",
            "review_author": "Giorgi"
        },
        {
            "review_text": "I have a Microsoft Surface pro 6 with i7 processor, 16gb ram, 256gb hard drive. I bought this computer hoping to draw, with the newest stylist, and do general writing on Word. I also use it for photo editing using Affinity culling through over 3,000 photos. Overall, I have found the machine difficult to use with the programs I like. (Affinity, Art Rage, Adobe sketchbook, and Word mostly. I also use the photo program that comes with the machine). For drawing I find the Apple Pro outperforms this machine. The combination of the Apple Pro and it's Apple pencil work better, is more accurate, and gives the user a more artistic feel. For working in Affinity Photo, Krita Art or other large art programs, the icons on the programs are so small that I can't see them. Literally, there are so many commands shown on the screen that the print is micro-sized. As I write this review, the print is micro-sized as well. I have not had super small print problems on other laptops. The one game I've tried to play on this machine, is The Operational Art of War 4 from Matrix games. This is a fairly intensive game that uses a lot of computer power, but the makers have figured out how to run it on normal computers with 4 gigs or less RAM and far less speed than my Surface pro 6 has; nonetheless, the game would not play on the Surface Pro. I downloaded it on an older computer with much less RAM and a lesser chip and the game ran fine. I tried loading the game onto the Surface several times, and completely erasing the game each time before the download, but it still fails to run the war game. The keyboard is very good. The pressure on the keys is almost perfect and I have not had the trampoline problems others have reported. The keyboard is thin but works well. One major complaint is the pad in the center of the palm rest. I don't know how it works but it doesn't work anything like the pad on a previous Apple laptop. A very, very light tap seems to trigger the command, and a strong push that causes the pad to click doesn't do anything. Tough for me to figure out. I have attached a normal cheap mouse and that works fine. Using the Surface pen (stylist) doesn't make things any better except when freehand drawing. It does work like your finger on the screen when scrolling, but trying to hit a small command box is harder than using the mouse. In drawing, I feel the stylist is nowhere near as good as the Apple pencil. Overall, the Surface is a disappointment. I bought the fastest, strongest machine I could so runing the photo programs and the art programs would be easy.. However, the programs do not run well on the Surface pro 6, the pen is hard to use for drawing, and the drawing programs have problems the pen does not overcome. Even the Word program is glitchy, in that, I have lost portions of my documents instantly... and without explanation. Out of nowhere I lost two thirds of a long review while I was right in the middle of typing a sentence. No explanationl from Microsoft, and others have complained. This might not be a problem restricted to the Surface, but I've never experienced this difficultly before I started with the Surface and I have not had the problem with any other machine. AD2",
            "review_posted_date": "07 Dec 2018",
            "review_header": "Disappointing and Hard to Use",
            "review_rating": "3.0 ",
            "review_author": "Alan Dale Daniel"
        },
        {
            "review_text": "Bought 256gb version came with black keyboard cover for $999. Added the Pen & Black Arc Mouse. Been a month no issues even updating to 1809 tho took some hours due to slower wifi connection. Added the Microsoft Dock picked up for $126 to drive external monitors. Use to have the iPad Pro 10.5\" and was the perfect size for holding and writing and drawing. And still gives the closest inking and writing to actual writing. But Microsoft has made some great strides in getting real close to matching the iPad experience. And does a real good job in matching drawing and writing experience. Got the Black version so concerned with some complaints about easily scratched or chipping on edges. So far being careful always laying down on keyboard cover side. Don't notice any chipping or scratches yet. Finally did a all out battery test yesterday to see if it lived up to it's 8hrs - 9hrs battery claims by others. SP 6 i5/8gb/256gb Pencil Arc Mouse. Mini-Display Cable driving 23\" Display. Yep on battery power no A.C. to the SP. On 1809 update got a week ago. Battery set on \"Better Performance\" one notch down from \"Best Performance\" Not even trying the lower battery savings settings. Screen at 50% set screen and shutdown to \"Never\" as wanted system always on for drain down test. So had Firefox open always 2-8 tabs open loading pages. During the test two different times during the day a 1hr. Youtube and 2hr. Youtube video played thru in Firefox. File Explorer,Task Manager open. Also OneNote drawing and writing on and off over the day. Wordpad was typing up documents. Autodesk Sketchbook working on sketch. Doing all driving 23\" Display also. Taking breaks away from time to time. After 7.5hrs was at 10% battery from starting at 100%. Highly recommend the Microsoft Complete for $149 as will give an additional year and two incidents of accidental breakage. Which takes a load of worries on my mind. Have up to 45days after device purchase to acquire it. Next month or so plan to complete replace my 2010 Win7 Amd dual-core aging desktop. Will acquire a 32\" 4k display to go along with my 23\" older monitor for dual display setup. Add a external keyboard,mouse,speakers for a complete desktop replacement. That I can grab the surface throw in my camera bag and use out on a shoot. So far zero issues. No light bleed I can see might be a tiny bit? No windows updates going bonkers. Sleeps and wakes up just fine. No parallax error or lagging except on using large custom brushes. Exceptionally Happy overall. Kind of dismayed of the price but sale price made it for me. Also finding the heavier and bulkier 12.3\" screen more cumbersome hand holding. Have to look into maybe a hand strap to help that. Otherwise plan to be my desktop replacement and tablet/laptop on the go.",
            "review_posted_date": "25 Dec 2018",
            "review_header": "Pleasantly surprised and sale price made it possible.",
            "review_rating": "5.0 ",
            "review_author": "Orbmiser"
        },
        {
            "review_text": "I am very unhappy with the Surface Pro 6. I have used Apple products for more than 10 years but as my old MacBook is, well old, I decided to try the Surface Pro as it works as a tablet and laptop. It is a glitchy and challenging-to-use machine. The Pictures app is horrible! It kept crashing when I attempted to transfer photos from my phone and then it just crashed for no reason at all. I uninstalled it and downloaded it and it worked for a day. The next day, when I opened the app, it was a black window, no photos, no nothing. There is no text messaging app that works unless you have a Windows phone. The icons on the bar keep disappearing. The web browser is terrible so I used Chrome instead. When I realized after 4 days that I was spending more time googling questions to fix different things on the Surface than I was spending enjoying the Surface, I returned it. By the way, every issue I googled had many many people with the very same issues.",
            "review_posted_date": "07 Dec 2018",
            "review_header": "I returned this very disappointing Surface Pro 6",
            "review_rating": "2.0 ",
            "review_author": "sheilatini"
        },
        {
            "review_text": "Was really excited to buy this product last Thanksgiving. Waited ~1 month to give it to my husband, who opened it a few days ago. Now it’s stuck in an infinite boot screen loop, which is apparently a common issue based on a cursory google search. I’ve tried to hard reset the device as per online instructions, but with no luck. Apparently the only option now is to downlod a recovery usb, which I can’t do given that I don’t have a 16 gb usb lying around. So now I’m stuck with a ~1 week old paperweight.",
            "review_posted_date": "01 Jan 2019",
            "review_header": "Useless",
            "review_rating": "1.0 ",
            "review_author": "Gregorio Mantaring"
        },
        {
            "review_text": "If you are an individual who is on the go and always working, Microsoft’s Surface Pro 6 will meet all your needs of being portable and powerful. Why The Surface Worked for Me: My version of the Surface is the i5 processor with 8 GB of Ram and 256 GB of storage. To tech enthusiasts, this would come across as a very low-performance laptop, but in reality, when you’re on the go, this is still excellent performance to portability. For example, after pulling my Surface out from my backpack, it is always ready to work as it boots on in a second. From there, I double click my Surface Pen and my notes are right in front of me. The touchscreen and pen combo then allows me to write my notes as if I’m writing on a piece of paper. Meanwhile, everyone else is still waiting for their bulky laptops to turn on, and I’m ready to face the day. Also, as a Computer Science major, I was surprised at how well the Surface handled big applications in terms of battery life. I usually have several large applications open for entire days ranging from word to excel to even running a server in the background. Despite all the apps running in the background, I am still going through my classes without any hiccups. Even after an overnight stay in the library without a charger, the laptop still has enough power to last me another day. Why it Would Work for You: -You would like a 2-in-1 tablet and laptop combo. -You are always on the go and need to be lightweight. -You want something that is both powerful and can go anywhere with you. -You are often away from an outlet or charger. -You want an intuitive laptop that makes your day easier. -You are a student or often travel. Why it Would Not Work for You: -You rarely see a need for a touch screen. -You have no reason to have a small laptop. -You agree that the price to specs is on the high side, especially for the better models. Final Thoughts: As a student, Microsoft’s Surface Pro 6 met all of my needs. However, the price may be too high and it may not fit all your needs. So, if you feel like you’ve wanted a 2-in-1 laptop that is sleek, powerful, and convenient, then I recommend giving the Surface Pro a shot.",
            "review_posted_date": "15 Feb 2019",
            "review_header": "Sleek, Powerful, and Convenient. But may be too pricey.",
            "review_rating": "5.0 ",
            "review_author": "Keb B"
        },
        {
            "review_text": "I was in the market for a good tablet when I ran across the Surface Pro 6. I liked the fact that it ran Windows 10 and could also function as a laptop and \"portable desktop\" if needed. As a tablet, I found it glitchy and ill-conceived. The on-screen keyboard functioned inconsistently, and the taskbar was intermittently unresponsive which made it almost impossible to use. I spent hours with Microsoft support trying to get it to work properly, but nothing they did made any difference so I returned it after a week. When reading pdfs, I also found the image quality to be inferior to my desktop and other devices I own; letters were not smooth and had a block-like appearance when zoomed-in. After reading some reviews online, I suspect there may have been nothing wrong with my Surface Pro 6, and the problems I experienced were likely secondary to Windows 10 being a poor tablet OS. In conclusion. the Surface Pro 6 may function well as a laptop or \"portable desktop,\" but it is not a good tablet.",
            "review_posted_date": "22 Jan 2019",
            "review_header": "Not a good tablet",
            "review_rating": "2.0 ",
            "review_author": "Tesla"
        },
        {
            "review_text": "Amazing product for what it is. If your mobile and need plenty power and versatility this is for you. I have the i7, 16gb Ram, 512gb memory. She runs lightening fast, plenty power, and stays cool. I have been putting it through the paces and I realize it runs better the longer I run it. Brilliant rich vibrant screen (not very great in day light though). I only wish there was USB-C. All else brilliant.",
            "review_posted_date": "12 Feb 2019",
            "review_header": "Best Surface Yet",
            "review_rating": "5.0 ",
            "review_author": "Keagan"
        },
        {
            "review_text": "Brand new machine out of the box reboots itself almost every night (maybe windows update every night? I have no idea). Go to your Microsoft account to see a little bit of the information that Microsoft collects from your computer: every time I go through the privacy settings I find a new surprise (e.g. browsing history in Edge). Yes, I know this this is about the default OS (by the same company), and not about the hardware. They come together, both are the same company. All of you that installed Linux instead of windows on this device can ignore this issue. Tech support is poor and inaccurate.",
            "review_posted_date": "08 Dec 2018",
            "review_header": "Unstable and the worst at privacy",
            "review_rating": "2.0 ",
            "review_author": "8235"
        },
        {
            "review_text": "I have had this computer for 3 months. It works perfectly. It is complicated to use at first but it comes with instructions. Amazon always offer a great service, for this reason is my favorite online store.",
            "review_posted_date": "24 Jan 2019",
            "review_header": "👍🏻👍🏻",
            "review_rating": "5.0 ",
            "review_author": "Elena"
        },
        {
            "review_text": "Developers should be ashamed of this product. Give it about 10 years and they may be worth buying, I would break mine if I didn't spend so much money on it. save your money, DO NOT BUY",
            "review_posted_date": "20 Jun 2019",
            "review_header": "Most horrifically counterintuitive device i have ever bought",
            "review_rating": "1.0 ",
            "review_author": "Cody"
        },
        {
            "review_text": "I I've always wanted to have a device that can easily read PDFs and take notes. It fully meets my requirements.",
            "review_posted_date": "26 Dec 2018",
            "review_header": "Very Good Device",
            "review_rating": "5.0 ",
            "review_author": "Wei"
        },
        {
            "review_text": "I got electric shock when I touch Microsoft Surface",
            "review_posted_date": "17 Jan 2019",
            "review_header": "I got electric shock when I touch Microsoft Surface",
            "review_rating": "1.0 ",
            "review_author": "Kallu Sureh kumar"
        },
        {
            "review_text": "Finally can use this beauty....love it very much",
            "review_posted_date": "15 Mar 2019",
            "review_header": "Love it very much",
            "review_rating": "5.0 ",
            "review_author": "Mohd fadjri"
        },
        {
            "review_text": "not enough to notebook performance.",
            "review_posted_date": "06 Mar 2019",
            "review_header": "It is not notebook performance.",
            "review_rating": "4.0 ",
            "review_author": "seung"
        },
        {
            "review_text": "Haven't used it. It's a gift to my sister. She likes it anyway.",
            "review_posted_date": "14 Dec 2018",
            "review_header": "Gift to my sister",
            "review_rating": "5.0 ",
            "review_author": "Nerd"
        },
        {
            "review_text": "Good laptop",
            "review_posted_date": "01 Jan 2019",
            "review_header": "Highly recommend",
            "review_rating": "5.0 ",
            "review_author": "Jun FAN"
        },
        {
            "review_text": "Works Good, Great Price, and small enough to take any where you go!",
            "review_posted_date": "16 Mar 2019",
            "review_header": "Great Little Laptop!",
            "review_rating": "5.0 ",
            "review_author": "C. R."
        },
        {
            "review_text": "Very nice",
            "review_posted_date": "17 Feb 2019",
            "review_header": "Fast",
            "review_rating": "5.0 ",
            "review_author": "James m"
        }
    ]
}